{"\"De revolutionibus orbium coelestium\", was a written in 1543, theorizing a heliocentric universe.  Who wrote it?":"Nicolaus Copernicus","\"Marking\" is 1 of the 2 phases of garbage collecting. What is the other phase?":"Sweeping","\"RISC\" is an acronym for: ___ Instruction Set Computing?":"Reduced","\"Rayleigh scattering\" answers what childhood question?":"Why is the sky blue?","\"S/2012 (134340) 1\" was discovered in July 2012 and nicknamed \"P5\". What is it?":"Pluto's fifth moon","\"Tux\", a penguin, is the mascot of ___?":"Linux","3D is height, width and breadth. Under Einstein's general theory of relativity, what is the fourth dimension?":"Time","90 mJ (millijoules) would be equal to how many joules?":"9 x 10⁻²","A \"Universal Machine\" was a concept designed by which computer scientist?":"Alan Turing","A \"query plan\" is associated with which of these areas of computer science?":"Databases","A .dba file is best described as which file type?":"Database","A Blue whale has a heart roughly the size of a what?":"VW Beetle","A DECREASE in the angle between 2 body parts (for example: your knee joint upon sitting down) is called what?":"Flexion","A MIDI file is a way of representing what?":"Musical sounds","A TRIE is a variant of what data structure?":"Tree","A USB flash drive is known by what other name?":"Jump Drive","A ___ server is a dedicated network server or service that saves web pages or Internet content temporarily and locally.":"Cache","A binary compound contains only 2 different types of atoms.  Which of these is NOT a binary compound?":"C₆H₁₂O₆","A body's momentum is the product of its mass and what?":"Velocity","A bug related to what was detected in the Intel P5 Pentium processors in 1994?":"Floating point math","A carnivore (eagle) that would eat another carnivore (fox) would be at trophic level 4.  What are the eagles called?":"Quaternary consumers","A carnivore (fox) that would eat a plant-eating herbivore (rabbit) would be at trophic level 3.  What are the foxes called?":"Secondary consumers","A circuit with more than one path is known as a what circuit? ":"Parallel","A climbing or trailing plant may also be known by what other name?":"Vine","A clock or wristwatch is one of these. What is another name for something that measures time?":"Chronometer","A coloring algorithm typically involves which of these data structures?":"Graphs","A compiler converts a high-level program code into which of these?":"Machine code","A database ___ of a database system is its structure described in a formal language supported by the database management system?":"Schema","A gas engine completes a work cycle in 20 secs, and does 600 Joules of work. What is its average power, in joules/second?":"30","A herbivore (rabbit) gets food by eating a trophic level 1 plant. The rabbit is at trophic level 2.  What are the rabbits called?":"Primary consumers","A man has a 60kg mass on Earth. What would his mass on the moon be?":"60kg","A rod's true length is 2.3m.  It's re-measured, giving 4 values: 2.1, 2.4, 1.9 and 2.6m.  Which is true about the measurement?":"Not precise nor accurate","A segment in an IPv6 (Normal) addresses can be any hexadecimal value from 0 to ___?":"FFFF","A shooting star is another name for what phenomenon?":"Meteor","A shop floor lathe produces 160 Joules of work by using 2000 Joules of energy. What is its efficiency?":"8%","A tortoiseshell cat is most likely what?":"Female","A tuning fork's frequency is 8000 Hz. How many vibrations does it make in 20 seconds?":"1.6 × 10⁵","A type of clonal tree colony is a single organism, and is estimated to be 80,000 years old.  What type of tree is it?":"Aspen","A white metal that burns in water, plus a poisonous green gas, combine to make what substance?":"Table salt","AMD's first x86 processor was called the K5. What did the K stand for?":"Kryptonite","Absorbed or evolved heat is measured using what?":"Calorimeter","According to Einstein's special theory of relativity, E=mc². What is the c?":"The speed of light","According to Fred Brooks, the addition of  what to a late software project makes it later?":"Manpower","According to Micky Malka of Ribbit Capital, regulation of Bitcoin is not just inevitable, but is also what?":"Desirable","According to Newton, mass times acceleration is equal to what?":"Force","According to web tracking firm StatCounter, nearly how many percent of all web traffic is coming from smartphones and tablets?":"30%","Acuity of hearing is measured using what?":"Audiometer","Ada Lovelace's notes contain an outline of a \"program\" to calculate what kind of numbers?":"Bernoulli","Advil and Nurofen are brand names of what nonsteroidal anti-inflammatory drug?":"Ibuprofen","Aerobic respiration releases more what than anaerobic respiration? ":"Energy","Aerodynamically speaking, this object's 330-500 dimples \"turbulate the boundary layer.\" What is it?":"Golf ball","After what famous mathematician was an algorithm to find the greatest common divisors of two numbers named?":"Euclid","After what former CEO did IBM name its Jeopardy-beating AI system?":"Thomas Watson","After which of these mathematicians are a 'code', a 'distance', and a 'window' all named, which are used in computer science?":"Hamming","After whom is this 'law' named: \"The value of a telecom network is proportional to the square of the no. of users of the system\"?":"Robert Metcalfe","Against which statement in procedural languages did Edsger Dijkstra write a critical paper?":"GOTO","Air moisture is measured using what?":"Hygrometer","Air pressure is measured using what?":"Barometer","Alan Turing co-wrote Turbochamp, one of the first programs designed to do what?":"Play chess","Alcohol content of wine is measured using what?":"Oenometer","All deserts are found in where? ":"Very dry areas","All the members of a single species that live in a habitat is called the what? ":"Population","Alopecia is a condition in which a person loses what?":"Hair","Also the name of a Mac browser, what word do we get from the Arabic verb meaning “to travel”?":"Safari","Altitude is measured by using what?":"Altimeter","Amazon's EC2 is a cloud computing service. What does the \"E\" stand for?":"Elastic","Americium was named for both Americas. But what was the only element named for a single continent?":"Europium","Amount of chlorine in a solution is measured using what?":"Chlorometer","Amount of oil in a substance is measured using what?":"Oleometer","Amount of salt in a solution is measured  using what?":"Salinometer","An Aberdeen Angus is a type of what?":"Cow","An INCREASE in the angle between 2 body parts (for example: your knee joint upon standing up) is called what?":"Extension","An IPv6 address can have 2 types of formats.  One is Normal, or pure.  What is the other?":"Dual","An electronic circuit that performs a Boolean function is known as a what?":"Logic Gate","An ion has a what? ":"Charge","Animals of the Ursidae family are what?":"Bears","Apache Hadoop acronym \"YARN\" means \"Yet Another ___\"":"Resource Negotiator","Apart from \"Volume\", \"Velocity\", and \"Variety\", what is another term used by some organizations to describe big data?":"Veracity","Approximately how far below the ground (sea level) would the center of Earth be?":"3959 miles (6371 km)","Approximately what percentage of the atmosphere is made of oxygen?":"20%","Argon is named for one of its properties. If you were nicknamed Argon for the same reason, what would you be?":"Inactive","As of March 2014, the bitcoin system surpasses the average market cap of how much?":"$4,5 billion","As opposed to a binary system, a denary number system uses which digit range?":"0-9","As opposed to a variable, the value of which construct in a programming language never changes?":"Constant","As social networks become more accountable to public shareholder, what sort of \"traditional\" business models will be expected?":"Pay to play","Asexual reproduction requires what? ":"One parent","Aspirin was invented in what year?":"1897","At the time of commercial introduction, what was ethernet's largest competition for LAN networking?":"Token Ring","At trophic level 1, plants and algae make their own food.  What are they called?":"Primary producers","At which scientific institution was the World Wide Web invented?":"CERN","Available since 1999, which online grocery store sends care packages to students, military personnel, and campers?":"NetGrocer.com","BSD is a family of operating systems derived from UNIX. What does the B stand for?":"Berkeley","Ba is the chemical symbol for what element?":"Barium","Barney Clark was the first recipient of what?":"A permanent artificial heart","Basalt and Granite are examples of what classification of rock?":"Igneous","Based on ZenithOptimedia forecasts, how much will be spent on paid search, by 2015?":"$71.1 billion","Based on an IBM study, approximately how much data existed in the digital universe in 2012?":"2.7 zettabyte","Bash, zsh, Korn are examples of what kind of program usually seen in UNIX environments?":"Shell","Batteries convert chemical energy into which kind of energy? ":"Electrical","Beavers have an alarm signal, to warn other beavers of something sinister.  What is it?":"Slapping water with their tail","Because it is a color that would absorb more light energy, which of these colors would make your coat warmest in the winter?":"Black","Besides killing enemies, how do humans gain credits \"Aliens Versus Predator: Extinction\"?":"Fixing atmospheric generators","Bile neutralises stomach acid. It's used in digestion to break down lipids and is made by the liver. What color is bile?":"Yellowish brown","Binary compounds contains only 2 different types of atoms.  Which is a binary compound?":"H₂O","Bitcoins are kept up to date with the help of cryptography and what other device?":"Copious computing power","Bitcoins do not move around when transferred; they are best understood as entries in a giant ledger. What is it also known as?":"Blockchain","Bob dumps a chemical into water and expects an endothermic reaction. What does he expect to happen?":"Solution gets cooler","Brontophobia is the fear of what?":"Thunder","By default, most web browsers use which colour to denote a hyperlink?":"Blue","By what more common name are the Aurora Borealis known?":"Northern Lights","CFC's are being phased out of use because they deplete the Earth's ozone layer. What are they commonly referred to as?":"Freon","Caroline Herschel, a notable female contributor to science, made which of the following contributions to astronomy?":"All listed answers","Cat6a is the 6th generation Ethernet cable specification, supporting speeds up to ___?":"10 Gbps","Cats are born with which colour eyes?":"Blue","Chalcopyrite is a main source of what metal?":"Copper","Chalk is primarily made up of what chemical compound?":"Calcium Carbonate","Charge in motion is called what? ":"Current","Charles Babbage first described his Analytical Engine in which year?":"1837","Charles Darwin is most commonly associated with which branch of science? ":"Biology","Chemicals secreted by glands are known as what? ":"Hormones","Christopher Cockerell invented what?":"Hovercraft","Clemens Alexander Winkler discovered element number 32 and named it for his homeland. What is it?":"Germanium","Closed circuits have no what? ":"Gaps","Colorful iridium gets its name from the Latin iris, in reference to what colorful item?":"Rainbow","Complete the missing half of these fictional lovers: Romeo and ___?":"Juliet","Computer scientists Aho, Weinberger, and Kernighan together invented which programming language?":"AWK","Considered almost as the Nobel Prize in computer science, for whom is this ACM highest honor named?":"Alan Turing","Continuous growing of one type of crop is known as what? ":"Monoculture","Copper and tin mix to create which alloy? ":"Bronze","Cumulonimbus are a type of what?":"Cloud","Current times resistance equals what? ":"Voltage","DNS Servers translate a web address/host name to a what?":"IP address","Depending on who you ask, what range of biological classification levels are there in the taxonomic standard hierarchy?":"7-9","Diamond is an allotrope of which element?":"Carbon","Discovered in 1789, what element did Martin Heinrich Klaproth name for a planet?":"Uranium","Do sharks have any bones? ":"No, they have cartilage","Dolphins are what? ":"Carnivores","Dr. Rafael Grossmann was the first person to integrate Google Glass into the operating theater, for what procedure?":"PEG","Dry ice is the solid form of what?":"Carbon dioxide","During World War II, Alan Turing worked on cracking the German cipher machine. What was it called?":"Enigma","During which phase of the moon can a solar eclipse occur?":"New moon","EWDs are manuscripts written by which of these computer scientists?":"Edsger Dijkstra","Ebola is a high mortality rate human disease. What is it caused by?":"A virus","Electric current is measured using what device? ":"Ammeter","Electric current is typically measured in what units? ":"Amperes","Electricity isn't considered a primary energy source as it is produced by what? ":"Another energy source","Emilie du Chatelet, a notable female contributor to science, translated Isaac Newton's most famous book into French.  What book?":"Principia","Ethanol can also be known by what more common name?":"Alcohol","Everyday, how many bytes of data do we create?":"2.5 quintillion","Expert members of the IEEE have estimated up to 75% of all vehicles will be autonomous by which year?":"2040","FLOPS is an acronym.  It means ___ operations per second?":"Floating Point","Fibropapillomatosis (aka FP) is a disease afflicting sea turtles.  It's linked to which of the following factors? ":"Herpes virus","Fibropapillomatosis (aka FP) is a disease specific to what marine creature? ":"Green sea turtles","File extensions .rar and .zip indicate which type of file?":"Compressed","Files with .pl extensions are associated with what programming language?":"Perl","First isolated in 1808 by Humphry Davy, which element is found in lime, cement, milk and teeth?":"Calcium","Flying at the speed of sound is also known as flying at ___.":"Mach 1","For Computer Science 101, what's a reference to a value or object's memory location?":"Address","For a dial-up internet connection, speeds max out at around what?":"56Kb/s","For how long is a dog pregnant?":"9 Weeks","For many of us, the morning just isn't right until you've had a shot of C₈H₁₀N₄O₂. Where would you get it?":"From coffee","For the modern constellation mappings, what culture is generally credited for being the organizers and cataloguers?":"Greeks","Found in both CFCs and in toothpaste, what pale yellow gas is the most reactive of all the elements?":"Fluorine","Founded in 1922, what International group assigns names/features to celestial objects, such as constellations?":"Intl Astronomical Union","Founded in 2005, which used car buying advice site is visited and read by around 4 million car buyers per annum?":"Used Car Expert","Freemium voice-over-IP service, Skype, got its name from which two words mashed up together?":"Sky and Peer","From Gulliver's Travels, which term describes a computer architecture in which the most significant byte has the lowest address?":"Big-endian","GDB is a software product used for what purpose?":"Debugging","Generally, at what age do wisdom teeth start to appear?":"17","Generally, the lower a storage type is in the hierarchy, the lesser its bandwidth and the greater its access ___ is from the CPU.":"Latency","Gentoo is a distribution of which operating system?":"Linux","Germany's ___ obtained a patent for his compression ignition engine in 1893.":"Rudolf Diesel","Globally, which fossil fuel is the most used type for generating electricity?":"Coal","Grasslands are located on every continent except which one? ":"Antarctica","Greenwich is situated at zero degrees of what?":"Longitude","Guido van Rossum is called the 'BDFL' or \"Benevolent Dictator For Life\" of which computer programming language?":"Python","HCl is what sort of compound? ":"Acid","Halley's Comet has a period lasting approximately how many years?":"75","Hanging valleys are formed by the action of what phenomena?":"Moving ice","Here are 5 of 6 main computer programming paradigms: imperative, declarative, functional, object-oriented, logic.  What's left? ":"Symbolic","Here are 5 of 6 main computer programming paradigms: imperative, declarative, functional, symbolic, logic.  What's left? ":"Object-oriented","Here are 5 of 6 main computer programming paradigms: imperative, declarative, symbolic, object-oriented, logic.  What's left? ":"Functional","Here are 5 of 6 main computer programming paradigms: imperative, symbolic, functional, object-oriented, logic.  What's left? ":"Declarative","Here are 5 of 6 main computer programming paradigms: symbolic, declarative, functional, object-oriented, logic.  What's left? ":"Imperative","Here's a bit of household science. What causes dust to collect into dust bunnies?":"Static electricity","How are hormones transported around the body? ":"Blood stream","How can you tell the age of a tree? ":"Number of rings","How do PC parallel port send and receive data?":"8 bits on 8 wires","How do PC serial ports send and receive data?":"1 bit at a time","How do business-to-business companies measure social media effectiveness?":"Cost per lead","How do flowers attract bees and insects? ":"Bright colors","How do lichens indicate levels of air pollution? ":"They don't grow","How does a dog's hearing compare to humans? ":"Dogs hear better","How does static electricity build up when walking on a carpet? ":"Friction","How is binary number 101 in presented as an octal?":"5","How long does the light from the sun take to reach the earth?":"8m 30s","How many \"arms\" do most snowflakes have?":"6","How many \"octets\" of numbers make up an IPv4 address?":"4","How many Earths would fit inside the sun?":"Circa 1,000,000","How many TOTAL lithospheric plates does the Earth have?":"20","How many US pints are in 1 liter?":"2,1","How many astronauts crewed the Gemini series of spacecraft?":"Two","How many astronauts crewed the Mercury series of spacecraft?":"One","How many atoms are there in a molecule of water?":"3","How many bits make up one byte?":"8","How many bones are in the human appendicular skeleton?":"126","How many bones are in the human axial skeleton?":"80","How many carats in pure gold?":"24","How many carbon atoms are in a benzene ring?":"6","How many chambers of the heart do plants have? ":"None","How many cores does a \"quad-core\" processor have?":"4","How many different types of lunar eclipses are there?":"3","How many elements are represented in almost all (99%) of the ocean's different salts?":"6","How many hairs on average do humans have on their head?":"100,000","How many hearts does an earthworm have?":"5","How many known chemical elements are there?":"118","How many languages are available on Facebook as of April 2014?":"80","How many legs does a spider have?":"8","How many millimetres are there in one inch?":"25.4 mm","How many moons does Earth have?":"1","How many moons does Venus have?":"0","How many noble gases are there?":"6","How many of Emily Dickinson's poems were published during her lifetime?":"7","How many seconds are in a 24-hour day?":"86400","How many seconds does it take to make 100,000 vibrations if a tuning fork has a frequency of 2000 Hz?":"50 seconds","How many sides does a Nonagon have?":"9","How many sides does a dodecagon have?":"12","How many stable isotopes does Tin (symbol: Sn) have?":"10","How many stomach compartments do cows have?":"4","How many stomachs does a moth have?":"0","How many theoretical IP addresses for use on the Internet does IPv4 provide?":"2³²","How many total neutrinos pass through our body each second without us even noticing them?":"10's of billions","How many volts of electricity is in a bolt of lightning? ":"Millions","How many watts are in a kilowatt? ":"1,000","How much can Bamboo plants grow in 24 hours?":"One meter (39 in)","How much did it take for Internet consumer-to-consumer corporation, eBay, to acquire e-commerce company, PayPal?":"$1.5 billion","How much global mobile advertising spend will be reached in 2014, up from the estimated $13.1 billion in 2013?":"$18 billion","How much money did it take for R.H. Donnelley to acquire the business advertising network, Business.com?":"$345 million","How tall is the largest known tree? ":"370 feet (113m)","Human hair and fingernails have what substance as its key structural component?":"Keratin","Humans have a total of 46 chromosomes.  How many are NOT homologous autosomal?":"2","Humans have a total of 46 chromosomes.  How many pairs are homologous autosomal?":"22","Hypermetropic people are what?":"Far sighted","Hypothetically, ¹²⁸UU is an isotope of element UU whose atomic number is 120. How many nucleons does ¹²⁸UU have?":"128","Hypothetically, ¹⁵⁹UU is an isotope of element UU whose atomic number is 140. How many nucleons does ¹⁵⁹UU have?":"No listed answer","H₂O contains how many distinct elements? ":"Two","IEEE 1394 is more commonly known as?":"Firewire","IPv4 addresses are most commonly viewed using which notation?":"Dotted decimal","IPv4 addresses are most commonly viewed with dotted decimal notation.  What defines this form?":"4 octets as decimals, with 3 .","IPv6 (Normal) addresses must have how many segments?":"8","IceCube observatory is one of the world's largest particle detectors (1 km³ of ice), looking for neutrinos.  Where is it?":"South Pole","If a bee gets nectar from a flower (to make honey) and also pollinates the flower in the process, what is their relationship?":"Mutualistic","If an oxalate (C₂O₄) ion having a -2 charge wants to form a compound with Potassium, what would be the chemical formula?":"K₂C₂O₄","If food goes through your intestines too fast, and doesn't get fully processed, what color might it be upon exiting your body?":"Green","If opposites attract, what atomic particles are opposite charge?":"Protons & Electrons","If single water molecules are held together by covalent bonds, how are multiple water molecules held together?":"Hydrogen bonds","If the B in a BST stands for Binary, what does the S stand for?":"Search","If the IPv6 (Normal) address is \"::\" what, if anything, does this signify?":"8 segments are 0","If the IPv6 address is  72a3  : 129f  : : 6d37 : ac3f, what, if anything, does the  :  : imply?":"Middle 4 segments are 0","If the IPv6 address is :  : 129f : 34ea, what, if anything,  does the :  : imply?":"First 6 segments are 0","If the number of protons stays the same, but the number of electrons of an element is varied, what results?":"Ion","If the number of protons stays the same, but the number of neutrons of an element is varied, what results?":"Isotope","If you have all the color-detecting cones in your retina working just fine (red, green and blue), what can we call you?":"A trichromat","If you open a .wav file on your computer, what are you likely to get?":"A sound","If you reach escape velocity, what are you escaping from?":"Gravity","If you were a platinum blond whose hair was actually spun from platinum, what color would it be?":"Silvery-white","If you were being electrocuted, what exactly would be killing you?":"Amperes","If you're a well-functioning average trichromat, about how many colors and their gradations should you be able to see?":"1 million","If you're genetically gifted enough to be a tetrachromat, about how many colors and their gradations should you be able to see?":"100,000,000","Image #1 shows a dicotyledon (seed with 2 embryonic leaves). What part of the seed is pointed to by letter F?":"Endosperm","Imagine an atom the size of a sports stadium. What object would be the same size as the nucleus?":"Tennis ball","In \"XML\", what does the letter \"X\" stand for?":"Extensible","In 1964, what did Murray Gell-Mann and Fred Zweig name for a word from James Joyce's \"Finnegans Wake\"?":"Quark","In 1989, which organisation published what would become a popular standard for C?":"ANSI","In 1998, what French website encouraged a revolution against the then 29-year-old regime of Omar Bongo in Gabon?":"Bongo Doit Partir","In 2008, UCLA scientists discovered that ___ when they unrolled adhesive tape in a vacuum chamber.":"X-rays were produced","In 2010, 140 of the largest charities reported receiving how much in online donation?":"$1.2 billion","In 2012, what administration announced the Big Data Research and Development Initiative?":"The Obama administration","In 2014, in what country will the first Big Data World Championship take place?":"United States","In 5 seconds, a tuning fork vibrates 2000 times. What is its frequency?":"400 Hz","In April 2014, popular bitcoin exchange Mt. Gox announced that how many bitcoins were missing, and stolen?":"850,000","In C programming, which of the following adds one string to the end of another?":"strcat();","In C programming, which of the following functions compares 2 strings?":"strcmp();","In C++ programming, what value must a destructor return?":"Destructors return no values","In C++ programming, which is NOT a protection level provided by classes in C++?":"Hidden","In C++, a class' ___ is called when an object is destroyed.":"Destructor","In C++, classes serve what purpose?":"All choices","In C++, how many times is a \"do while\" loop guaranteed to loop?":"1","In C++, how many times is a constructor called in the lifetime of an object?":"1","In C++, what does '\\0' mean?":"Null","In C++, what is the correct keyword to de-allocate memory?":"delete","In C++, what is the index number of the last element for an array of 50 elements?":"49","In C++, what is the only function all programs must contain?":"main( )","In C++, what operation would the asterisk operator allow on a pointer?":"Dereference","In C++, what operator compares two variables?":"Double equal (==)","In C++, what punctuation ends most lines of code?":"Semi-colon (;)","In C++, what punctuation marks are used to bound the beginning & end of code blocks?":"{  &  }","In C++, what return type is expected from this function: int func(float x, char y, bool z);":"int","In C++, what string escape code does  '\\n' perform?":"Newline","In C++, what string escape code does '\\\\' represent?":"Backslash","In C++, when would this code execute:  while (x<50) ?":"When x is less than 50","In C++, which answer accesses a variable in structure q?":"q.var;","In C++, which choice is a properly declared 2 dimensional array, JG?":"int JG [10][10];","In C++, which choice is a properly declared uni-dimensional array of 60 integers, XC?":"int XC [60];","In C++, which choice is the 5th element of the array named: score?":"score[4];","In C++, which choice is the first element of the array named: score?":"score[0];","In C++, which is NOT a valid loop syntax structure?":"Repeat while","In C++, which of the following boolean operators is used for logical \"and\"?":"&&","In C++, which of these is the proper declaration of a pointer?":"int *x;","In C++, which of these statements will declare a void pointer?":"void *voidpoint","In C, symbols such as \"~\", \"&\", and \"|\" are what type of operators?":"Bitwise","In C, what is the index of the first element of any array?":"0","In C, which conversions are possible?":"ALL choices","In C, which is a valid typecast?":"(char)a;","In COBOL, GOTO & IF-ELSE are control statements.  What's a 3rd?":"Perform","In Computer Science 101, what connects networks that use different link layer protocols?":"Gateway","In Fortran IV which of the following is a reserved word?":"No listed answer","In January 2014, what shuttle became the first self-driving vehicle to be available for commercial sale?":"Navia","In Java, \"double\" is a double-precision data type.  How many bits is it?":"64","In Java, \"float\" is a single-precision data type.  How many bits is it?":"32","In Java, class Error and class Exception are both children of what parent?":"Throwable","In Java, enclosing a string in double quotes creates a new string object, that has a special feature.  What feature?":"Object value is immutable","In November 2011, what website was the largest initial public offering since Google, which shortly after got overtaken by Zynga?":"Groupon","In Objective-C, what is the destructor method name?":"Dealloc","In Perl, what is the destructor method name?":"Destroy","In Unix, which of these is a computer program that runs in the background, rather than under the direct control of a user?":"Daemon","In Windows, searching with which three letters will bring up a command prompt?":"CMD","In a .csv file, what character separates values?":"Comma","In an IPv4 subnetted network, a routing prefix, such as 192.168.1.0/24, is expressed in what kind of notation?":"CIDR","In anatomical directions, which term means \"above, over\"?":"Superior","In anatomical directions, which term means \"away from, farther from the origin\"?":"Distal","In anatomical directions, which term means \"below, under\"?":"Inferior","In anatomical directions, which term means \"near, closer to the origin\"?":"Proximal","In cell biology, what is a very good example of a programmable mechanosynthetic device?":"Ribosome","In communication networks, a ___ is either a connection point, a redistribution point or a communication endpoint.":"Node","In computer science, what is the term for the time & RAM needed to execute an algorithm?":"Efficiency","In computer science, what term means joining multiple character strings end-to-end?":"Concatenation","In computing how many bits make one byte?":"8","In computing, what means to pause a device/application to achieve a consistent state?":"Quiesce","In discussions of cryptography, which names are typically used as examples of people sending messages to each other?":"Alice and Bob","In e-commerce, one of its software is known as a \"shopping cart\" in American English. What is the British English's term for it?":"Shopping basket","In humans, what are the male gametes called? ":"Sperm","In humans, what is the name of a color vision defect where 1 of the 3 basic color mechanisms is absent or not functioning?":"Dichromacy","In oceanography, what cline is based on the difference in ocean water density?":"Pycnocline","In oceanography, what cline is based on the difference in ocean water temperature?":"No listed answer","In order for online advertisement to blossom, what is needed to maximize brand exposure and facilitate sales for the retailer?":"Standardization of tools","In particle physics, what were preons thought to be?":"Constituents of quarks/leptons","In physics, of the 4 fundamental interactions, which does NOT break mirror reflection symmetry (aka P-symmetry or parity)?":"No listed answer","In physics, of the 4 fundamental interactions, which force(s) break(s) P-symmetry (aka parity)?":"Weak interaction","In programming, what is Hungarian notation used for?":"Names of variables","In reference to a C or C++ stack data structure, what would a \"peek\" accomplish?":"View a stack element","In reference to a C or C++ stack data structure, what would a \"pop\" accomplish?":"Remove a stack element","In reference to a C or C++ stack data structure, what would a \"push\" accomplish?":"Add a stack element","In relation to a stack, what does the acronym \"LIFO\" stand for?":"Last in, first out","In robotics, what rotation is performed by an end-effector in a plane that's perpendicular to the end of the manipulator arm?":"Roll","In robotics, what type of sensor measures linear/rotary motion by detecting the movement of markings past a fixed beam of light?":"Optical Encoder","In terms such as \"HTML\" and \"XML\", what do the letters \"ML\" stand for?":"Markup Language","In terms such as \"SaaS\", \"Paas\", and \"IaaS\", what does the fourth letter stand for?":"Service","In the ASCII character mapping, what character is binary 00000000?":"Null","In the C++ programming language, a character (char) data type is typically how many bytes?":"1","In the C++ programming language, a double data type is typically how many bytes?":"8","In the C++ programming language, a float is typically how many bytes?":"4","In the C++ programming language, block comments start with a ___ and end with a ___?":"/*  |  */","In the C++ programming language, in-line comments start with a ___ and end at the end of the line?":"//","In the SI unit system, what term would we use to measure electrical resistance?":"Ohm","In the Standard Model, which of these leptons are charged particles?":"All listed answers","In the United Kingdom, which government organization started collecting anonymized resident data for analysis in March 2014?":"The NHS","In the abbreviation \"ACM\", A is Association and C is Computing, what does M stand for?":"Machinery","In the abbreviation \"USB\", what does \"B\" stand for?":"Bus","In the chemical equation: SnO₂ + 2H₂ → Sn + 2H₂O, what are the Sn + 2H₂O?":"Products","In the chemical equation: SnO₂ + 2H₂ → Sn + 2H₂O, what are the SnO₂ + 2H₂?":"Reactants","In the context of Linux, what is a \"LILO\"? ":"Bootloader","In the context of biology, what is homology?":"Common evolutionary origin","In the diagram, if θᵢ = 45°, what is θᵣ?":"45°","In the following IP4 format (x.x.x.x), what is each \"x\" called?":"octet","In the game \"Grand Theft Auto\", players rise through the ranks of what career?":"Crime","In the name of the computer program \"Bash\", what does the \"Ba\" stand for?":"Bourne-again","In the name of the programming language FORTRAN, what does FOR- stand for?":"Formula","In the popular LAMP software stack, what does the \"A\" stand for?":"Apache","In the programming term \"API\", what does the I stand for?":"Interface","In the protocol HTTP, what does the H stand for?":"Hyper","In the study of Earth's magnetic field, what term refers to a line of constant magnetic declination?":"Isogon","In the world of object-oriented design, what are \"Bridge\", \"Façade\", \"Singleton\", and \"Prototype\" examples of?":"Design Patterns","In web site addresses on the Internet, \"http\" stands for?":"Hyper Text Transfer Protocol","In what era would we find the Triassic, Jurassic, and the Cretaceous periods?":"Mesozoic","In what year did Nike release the Nike+ Running App?":"2010","In what year did the Blue Security attempt to automate a denial-of-service attack against spammers?":"2006","In what year did the U.S. state of Nevada pass a law, permitting the operation of autonomous cars?":"2011","In what year did the so called dot-com bust occur?":"2000","In what year was 802.11g released?":"2003","In what year was C++0x officially published as the new C++11 standard?":"2011","In what year was Cars.com launched, where it is the second largest automotive classified site, second to only AutoTrader.com?":"June 1998","In what year was RS-232 introduced?":"1962","In what year was the first ever website published?":"1991","In what year was the original \"Resident Evil\" game released?":"1996","In what year, (approximately) did the number of Internet users reach 1 billion?":"2005","In which animal species does the male carry the offspring?":"Sea horse","In which country was the MP3 player invented?":"Germany","In which decade did the World Health Organisation declare smallpox eradicated?":"1970s","In which field is the Dijkstra Prize given?":"Distributed computing","In which form of algebra are there operations such as conjunction, disjunction, and negation?":"Boolean algebra","In which of these areas is Marvin Minsky a renowned expert?":"Artificial Intelligence","In which of these contexts does operation execution speed vary according to the user's machine?":"Client-side","In which version of Windows did the Start Menu make its first appearance?":"95","In which year did Internet consumer-to-consumer corporation, eBay, acquire e-commerce company, PayPal?":"2002","In which year was the Association for Computing Machinery (ACM) founded?":"1947","In which year was the satellite Galileo launched?":"1989","Inflammable or oily substance obtained by distillation of petroleum, also known as waxy candles or ___.":"Paraffin","Introduced by IBM, the Winchester was a type of what kind of device?":"Hard disk","Ir is the chemical symbol for which element?":"Iridium","Its definition is: Mass per unit volume.  We know it by what other name?":"Density","John Backus was associated with the creation of which of these programming languages?":"Fortran","Jons Jacob Berzelius not only identified silicon, selenium, thorium and cerium, he also developed what system?":"Chemical symbols","K is the chemical symbol for which element?":"Potassium","Ken Thompson & Dennis Ritchie, colleagues at Bell labs, teamed up & wrote the second version of the ___ operating system?":"Unix","Known as Pre-Mode 1, how long ago was the earliest recorded evidence of any stone tools use?":"3.3 million years ago","Leaked images from online retailer, Fancy.com, showed a mock-up of a new platform on Twitter. What is it called?":"Twitter Commerce","Leaves have a positive tropism response to what? ":"Light","Lemons contain which kind of acid? ":"Citric","Lines such as 10 PRINT \"HELLO\" would likely be from which computer language?":"BASIC","Lions and zebras are found in which biome? ":"Savannah","Lions live in groups called what?":"Prides","Lithium and tungsten were named for the Greek and Norse words for something. What?":"Stone","Lithospheric plates come together at which type of plate boundary?":"Convergent","Litmus paper turns what colour when in contact with an acid?":"Red","MULTICS was the immediate predecessor to which of these operating systems?":"UNIX","Made from burnt camel dung, what gas did the Egyptians name for one of their gods?":"Ammonia","Magnesium oxide is obtained when magnesium metal burns in the air. What causes magnesium to \"oxidize\"?":"Oxygen","Mammals of the Order Marsupialia have what unique feature?":"Pouches","Manindra Agarwal invented an algorithm to test which property of numbers?":"Primality","Marketers rate social media as the second-most important factor in organic search success, behind only which?":"Effective web pages","Mary Anning was a self-taught scientist/fossil hunter, finding 1000's of fossils from 200-140 mln yrs ago.  What period was this?":"Jurassic","Materials that allow electricity to flow through them easily are called what? ":"Conductors","Materials that don't allow electricity to flow through them easily are called what? ":"Insulators","Mercury and which other element are liquid at room temperature?":"Bromine","Metals are capable of conducting electricity because they have what? ":"Free electrons","Mg is the chemical symbol for which element?":"Magnesium","Microsoft Internet Explorer was replaced by which new Microsoft web browser?":"Edge","Mn is the chemical symbol for which element?":"Manganese","Modern physics deals with 3 basic types of spatial symmetry: reflection, rotation and ___?":"Translation","Modern physics deals with 3 basic types of spatial symmetry: reflection, translation and ___?":"Rotation","Modern physics deals with 3 basic types of spatial symmetry: translation, rotation and ___?":"Reflection","Movies depict humans living alongside dinosaurs, but we all know cavemen \"emerged\" well after dinosaurs. How many years after?":"66 million","Na is the chemical symbol for which element?":"Sodium","Name the Ethernet protocol which senses if packets can be transmitted and the shared medium (wire) is idle or not?":"CSMA","Named for James Van Allen, where would you find the Van Allen belts?":"The magnetosphere","Natural gas is another name for what gas?":"Methane","New elements usually have temporary symbols that start with what two letters?":"Uu","Nils Nilsson is a noted computer scientist in which of these fields?":"Artificial Intelligence","OSI is a conceptual model for functional communications.  What does OSI stand for?":"Open System Interconnection","Of the types listed, what I/O connection type is chronologically the oldest?":"Serial","Of these animals, which has the longest average lifespan? ":"Turtle","Of these elements, which is the most toxic to humans? ":"Lead","Of these, which is another name for rain? ":"Precipitation","Old newspapers oxidize. When the lignin in the paper hits oxygen, it reflects light differently, looking what color?":"Yellow","On May 15th, 2013  Google announced the integration of Gmail and what mobile payment system?":"Google Wallet","On average, how hot is Mars in comparison to Earth? ":"Cooler","On average, how long (in minutes) can a beaver stay underwater, if it has to?":"15","On average, how many hours a day does a Koalas spend sleeping?":"22","On the Mohs scale of mineral hardness, the hardest mineral is diamond. What is the softest?":"Talc","On the Mohs scale, Quartz is 7 and has an absolute hardness of 100.  Diamond's hardness is 1600.  What's its Mohs number?   ":"10","On what temperature scale does water boil at 212 degrees?":"Fahrenheit","On which continent did the ostrich originate? ":"Africa","On which social media platform can one \"like\" a post?":"Facebook","On which social media platform can one \"retweet\"?":"Twitter","Once solids reach their melting point, what do they become?":"Liquids  ","Online shoe and clothing shoe company Zappos.com was acquired by which online commerce company?":"Amazon.com","Osteoporosis primarily affects which part of the body?":"Bones","Out of 247 billion emails sent everyday, up to how many percent are spam?":"80%","Overlooking the harbour, where's this famous opera house?":"Sydney","Ozone molecules consist of 3 atoms of which element?":"Oxygen","PPTP is a tunneling protocol.  What is it an acronym for?":"Point-to-Point Tunneling","Part of Random Acts' social media campaign success was due to whom, having a large fan base on Twitter and Tumblr?":"Misha Collins","Pentium processors were a line of processors by which company?":"Intel","People who donated to Malaria No More, a social media campaign, got access to a collection of videos of how many celebrities?":"30","Per Brinch Hansen pioneered which of these forms of programming?":"Concurrent programming","Pitcher plants eat what? ":"Insects","Plants in tundra areas are usually what? ":"Low Lying","Plants usually grow from what? ":"Seeds","Plants which are able to store water are called what? ":"Succulents","Platinum got its name because it was found in the same mines as something else. What?":"Silver","Plumbers worry about pipes made from what element, whose abbreviation is Pb from the Latin plumbum?":"Lead","Polaris is our current North star. But in 3200 years, Earth's precession will make what new star the next North (pole) star?":"Gamma Cephei","Polarized sunglasses are a practical application of which physical principle?":"Brewster's law","Potatoes reproduce asexually using what? ":"Tubers","Private Cloud storage is often used for backing up data as part of which process?":"Data recovery plan","Pure water has a pH level of around? ":"7","Pyrophobia is the fear of what?":"Fire","QWERTY is the most common configuration of which common input device?":"Keyboard","QoS is a collection of techniques and technologies to help a network deliver predictable results.  What is QoS?":"Quality of Service","RDBMS = ___ Database Management System?":"Relational","REM isn't just a rock band. It's also ___?":"A state of sleep ","Rather than being a \"stock media\", what is social media represented by?":"Flow media","Ray Tomlinson sent the world's first email in which year?":"1971","Real-time, multi-tasking, and embedded are adjectives used to describe which of these?":"Operating Systems","Red Hat, Ubuntu, Debian etc. are distributions of which Operating System?":"Linux","Research on the role of networked advocacy using Facebook led to which term?":"Slacktivism","Roughly what percentage of the Earth's surface is covered in water? ":"70%","Ruby is a gemstone of which color? ":"Red","Rust is a common name for what chemical compound?":"Iron Oxide","SQL = ___ Query Language?":"Structured","SQL Inner joins are also know by what other name?":"Equijoins","SRI International's Augmentation Research Centre saw the birth of many important technologies. What does the S stand for?":"Stanford","SSL is a cryptographic protocol for communications security on the web.  SSL stands for?":"Secure Socket Layer","Savannah grasslands are found where? ":"Central Africa","Shown are 2 generalized seed types. The left image (labelled 1) is a dicotyledon seed.  What is the right side (#2) seed type?":"Monocotyledon","Sockets that use TCP or STCP are known as what?":"Stream sockets","Solaris is a version of Unix built by what company?":"Sun Microsystems","Solving the \"P versus NP\" problem would be a career-making achievement for somebody in what field?":"Computer science","Somatology is the study of what?":"The body","Some illnesses can be detected by smelling something coming from your body. What might that be?":"Breath","Somebody who studies limnology is interested in all things lacustrine. What does limnology study?":"Lakes","Speaking of \"cryptocurrency\", what is the word that is most frequently used for the term?":"Bitcoin","Spinning a magnet in a coil of wire generates what? ":"A current","Stephanotis are a type of what?":"Flower","Strictly speaking, if you've achieved a quantum leap, how much further ahead are you?":"0.00000000001 of a centimeter","Strontium carbonate and Strontium sulfate are used to help produce which colour in pyrotechnics?":"Red","Substances that are initially involved in a chemical reaction are called what?":"Reactants","Sue initially determines a substance's heat of fusion is 250 J/g.  Sue later refines it to 300 J/g.  What's her percentage error?":"20%","Sulphur crystals are normally what color?":"Yellow","Superman would fear what rare, well-hidden gas, whose name comes from the Greek for \"hidden\"?":"Krypton","TFT technology can be found in what device?":"LCD Monitor","The \"%\" operator in C is also referred to by which name?":"Modulo","The \"dust bowl\" of North America has been caused by what factor?":"Wind erosion","The #1 image is of a dicotyledon (seed with 2 embryonic leaves). What part of the seed is pointed to by letter A?":"Seed coat","The #1 image is of a dicotyledon (seed with 2 embryonic leaves). What part of the seed is pointed to by letter B?":"Cotyledon","The #1 image is of a dicotyledon (seed with 2 embryonic leaves). What part of the seed is pointed to by letter D?":"Plumule","The #1 image is of a dicotyledon (seed with 2 embryonic leaves). What part of the seed is pointed to by letter E?":"Radicule","The #1 image is of a dicotyledon (seed with 2 embryonic leaves). What part of the seed is pointed to by letter F?":"No listed answer","The 1st reproducible high-pressure, high temperature (HPHT) synthesis of diamond was done in 1953, in which country?":"Sweden","The ACID properties are associated with which database concept?":"Transactions","The ACM PODC Influential Paper Award in distributed computing was renamed after which computer scientist?":"Dijkstra","The Americans have won the most Nobel Prizes. People from which country have won the second most?":"United Kingdom","The B-Tree was invented by which of these computer scientists?":"Rudolf Bayer","The BIOS in newer motherboards has been replaced by the UEFI, or Unified ___ Firmware Interface?":"Extensible","The C# (called C sharp) programming language was created by which of these companies?":"Microsoft","The C.E.R.N. Large Hadron Collider is under the border of which two countries?":"France & Switzerland","The General Public License or GPL is a software license created by which organization?":"Free Software Foundation","The IEEE 802.3 standard is often referred to by which term?":"Ethernet","The IEEE medal, given annually for achievements in CS, was named after whom?":"John von Neumann","The Intel Pentium processor was the successor to which Intel processor?":"80486","The Internet is an example of what kind of network topology, which allows redundant paths for data flow?":"Mesh","The JRE is a run-time environment for which programming language?":"Java","The K&R book describes programming in which language?":"C","The MINIX operating system is famous for using which of these OS concepts?":"Microkernel","The Modulator Demodulater is often known as the what? ":"Modem","The Mohs Scale, ranging from Talc (1) to Diamond (10), measures what property of a mineral?":"Hardness","The North Star is also known as ________":"Polaris","The Phil Katz original tool PKZIP was designed for what use?":"Compression","The RSA algorithm is used in which of these areas of computer science?":"Cryptography","The Rorschach test uses ___?":"Inkblots","The Rosetta spacecraft (and Philae lander) travelled for 10 years and 6 billion km.  What did Philae finally get to do in 2014?":"Land on a comet","The Tomcat web server project is maintained by which of these organisations?":"Apache Software Foundation","The Unified Modeling Language or UML is used in which of these areas?":"Object oriented design","The Xbox is a video gaming brand created by which corporation?":"Microsoft","The addictive substance in alcoholic drinks is called what? ":"Ethanol","The anticipated shortage of IPv4 address produced new, stop-gap methods to mitigate the issue.  Which one doesn't qualify?":"IANA","The anticipated shortage of IPv4 address produced new, stop-gap methods to mitigate the issue.  Which qualify?":"All choices","The apparent shift in the frequency of a wave due to the relative movement of its source is known as what?":"Doppler Effect","The binary system of numbers uses which two digits?":"1 and 0","The bitcoin option is not a gimmick but rather, provides what kind of solution for companies to pay employees across borders?":"Cheap and practical","The center of an atom containing its protons and neutrons is called what?":"Nucleus","The computer language, FORTRAN (Formula Translation) was developed by what company?":"IBM","The days of social media being \"free\" marketing for companies are coming to an end. What term is used to describe them instead?":"Full monetizing mode","The direction of rotation of the earth on its axis is from what direction?":"West to east","The earliest documented member of the genus Homo is Homo habilis.  About how many millions of years ago did they evolve?":"2.8","The earliest example of mass emailing as a rudimentary form of distributed denial-of-service attack occurred on which day?":"Guy Fawkes Day, 1994","The famous TRS-80 personal computer was sold by which company?":"Tandy","The first method of online grocery delivery involves shipping using courier services. What is the alternative method known as?":"Personal delivery","The first widely known and successful programming language was developed from 1954 to 1957 at IBM, and was known as ___":"Fortran","The frequency in MHz or GHz at which the processor executes instructions is know as what?":"Clock Speed","The future of content marketing has to be seen in the relational context of a few resources. Which of the following is NOT one?":"Linguistics","The ground in a tundra is mainly what? ":"Frozen","The higher this computed number, the more an element/compound attracts electrons toward it.  What are we measuring?":"Electronegativity","The human body is mostly comprised of 4 elements (by % of mass).  Which is NOT one of these 4? ":"Iron","The human eyes are referred to as being in what body region?":"Ocular","The hyperloop is a conceptual high-speed transportation system envisioned by which entrepreneur?":"Elon Musk","The main asteroid belt of the solar system lies between which two planets of the solar system?":"Mars and Jupiter","The mandible is the scientific name for what specific part of the human body?":"Jaw","The material, graphite, is used in writing pencils. Of what element is graphite composed?":"Carbon","The mobile channel will become more and more integrated into what form of advertising campaigns?":"360-degree","The movement of a pendulum can be described as what type of motion?":"Simple harmonic","The octal numbering system consists of how many digits?":"8","The original 802.11 wireless protocol, as well as wireless 802.11 b/g/n all broadcast at what frequency (in GHz)?":"2.4","The original BASIC language was created at which U.S. school?":"Dartmouth","The pascal is a unit of what?":"Pressure","The previous unit name for frequency was \"cycles per second\". What is the current SI unit name for frequency?":"Hertz","The sap from which of these makes a famous syrup? ":"Maple","The scapula is the scientific name for which bone of the human body?":"Shoulder blade","The speed at which chemical reactions take place in our bodies is known as what? ":"Metabolic rate","The study of meteors is meteoritics. What, then, does meteorology study?":"Weather","The symbol for Palladium is: ₄₆Pd.  Which of the following is true about this element?":"There are 46 electrons","The symbol for a specific isotope for the 46th element, Palladium is: ¹⁰⁷Pd.  Which of the following is true about this element?":"There are 46 electrons","The temperature at which a solid becomes a liquid is known as what?":"Melting point","The term \"fecundity\" indicates what?":"Capacity to reproduce","The term \"modem\" is a contraction of what two words?":"Modulator / Demodulator","The transformation of a liquid into a gas is known by what term?":"Evaporation","The transition of a substance directly from the solid to the gas phase is called what?":"Sublimation","The transportation of sediments along a coast at an angle to the shoreline is called what?":"Longshore drift","The troposphere is what part of the atmosphere?":"Lowermost layer","The underground part of a plant is called the what? ":"Roots","The urochordates (aka tunicates or sea squirts) include which of the following groups?":"Arctic ascidians","The word \"Algorithm\" is said to be derived from the name of which of these mathematicians?":"Al-Khwarizmi","The word \"Galaxy\" comes from the Greek word for what?":"Milk","The world's first pocket calculator was invented by the Sharp Corporation in which year?":"1971","There are 4 primitive integer data types in Java. what is their order, from smallest to largest, for storing numerical values?":"byte, short, int, long","They say no two snowflakes are alike, but all snowflakes are alike chemically. What is the chemical formula for a pure snowflake?":"H₂O","This Italian Colosseum is located in what famous European city?":"Rome","This is the question Moe answered on a Simpsons parody of \"Millionaire.\" Which of the following is NOT a subatomic particle?":"Bonbon","This unit of measure's prefix name, \"exa\", has a 10ⁿ value.  What's n?":"18","This unit of measure's prefix name, \"yocto\", has a 10ⁿ value.  What's n?":"-24","Ti is the chemical symbol for which element?":"Titanium","Tim Berners-Lee is known as the inventor of the ___.":"World Wide Web","TrueType and OpenType are different types of what?":"Fonts","Two particles with the same charge will what? ":"Repel","Typically, every processor chip has both a FPU and a(n) ___?":"ALU","Typically, what is the salinity of seawater (in ppm = parts per million)?":"35","Unequal days and nights on the Earth are caused by what phenomena?":"Inclination of the axis","Used as a data type in the world of databases, what does the first \"B\" in the term \"BLOB\" stand for?":"Binary","Using the micro-blogging service Twitter, which company announced the imminent release of a study on Celiac disease?":"Mayo Clinic","Vitamin A is important for what?":"Vision","Volcanology is the study of volcanoes, lava, and magma. Which Roman god of fire was this science named after?":"Vulcan","W is the chemical symbol for which element?":"Tungsten","W. Richard Stevens was a well-known author on which of these topics?":"UNIX","Way before Apple's Siri, what was the name of the natural language parsing program developed by Terry Winograd at MIT in 1968?":"SHRDLU","We all know that Edmond Halley computed the orbit of a comet, which now bears his name.  What else did he invent/discover?":"All listed answers","What English word prefix is used for 10⁻¹²?":"Pico","What Google service is meant for users to search for products on online shopping website?":"Google Shopping","What Greek was first to identify that the pitch of a musical note is in proportion to the length of the string producing it?":"Pythagoras","What HTML tag is used for a break?":"<br>","What HTML tag is used for the largest heading?":"<h1>","What HTML tag makes any text after it bold?":"<strong>","What HTML tag makes any text after it italics?":"<i>","What PC device stores the BIOS?":"ROM","What PC device stores the code and data that are actively being accessed for processing by the CPU?":"RAM","What SI accepted unit equals 1 nautical mile/hour? Meterologists, ships, and planes use this term for air, water or wind speed.":"Knot","What TCP port does SMTP use by default?":"25","What TCP port is reserved for the HTTP protocol?":"80","What TCP port range is reserved for the NetBIOS protocol?":"137 to 139","What VPN term is used to refer to the encapsulation of packets inside other packets using a different protocol?":"Tunneling","What act was aimed to legislated the Internet and its uses worldwide?":"Freedom of Internet Act","What advocative action was made easier via the Internet, thanks to mass e-mail?":"Lobbying","What alliance of automotive manufacturers and technology companies is aimed at using operating system, Android, in automobiles?":"Open Automotive Alliance","What allows remote computers to connect to a specific computer/service within a private LAN?":"Port forwarding","What amount (US $) did Donald Knuth pay to people who found errors in his books?":"2.56","What are Lanthanides?":"Periodic table element group","What are bactrians and dromedaries?":"Camels","What are bitcoin wallets software sometimes called?":"Bitcoin client software","What are clouds mainly made of? ":"Water","What are sockets that use UDP called?":"Datagram sockets","What are the 2 terminals of a diode called? ":"Anode and cathode","What are the building blocks of all plants and animals? ":"Cells","What are the horizontal rows reading left to right on the Periodic table known as?":"Periods","What are the intersecting lines drawn on maps and globes?":"Geographic grids","What are the minor planets revolving between the orbits of Jupiter and Mars called?":"Asteroids","What are the moving charges in metal conductors? ":"Electrons","What are the safe-use specifications for the maximum length of a CAT-5 cable run in your home?":"~300 feet (100 meters)","What are the two ends of a magnet called? ":"North and south","What are triglycerides?":"The chemical form of fat","What are valence electrons?":"Bond-participating electrons","What are you most likely to do with C₁₂H₂₂O₁₁?":"Add it to food","What artificial fiber was invented in 1938?":"Nylon","What aspect of wave can be measured as the distance between two of its crests?":"Wavelength","What astronomical entities can be classified as elliptical, spiral, irregular, or starburst?":"Galaxies","What background process in Java-based systems periodically reclaims unused memory for the system?":"Garbage collector","What biological discipline is the study of heredity?":"Genetics","What biome is determined by very low rainfall? ":"Desert","What bus technology replaced the original serial port on current PCs?":"USB","What can an SQL join statement do?":"Combine records from 2 tables","What can be a disadvantage of hydroelectric power produced by using a dam? ":"Flooding","What can businesses based on or using the cloud avoid?":"Major IT integration costs","What causes tectonic plates to move? ":"Convection current","What causes the Earth's seasons?":"Earth's axial tilt","What charge do electrons have? ":"Negative","What charge does an electron carry?":"Negative","What chemical comprises most of your standard home fingernail polish remover?":"Acetone","What class of animals undergo embryonic development inside a mother's body, but has no access to her circulatory system?":"Ovoviparous","What color flower do hummingbirds prefer?":"Red","What color is the moon's sky?":"Black","What colored part of the eye controls the size of the pupil?":"Iris","What colour is lobster blood?":"Blue","What colour is octopus blood?":"Blue","What colour skin does a polar bear have?":"Black","What communications protocol is Bob Kahn best known for working on?":"TCP/IP","What company claims it attracts \"more than half a billion consumers every month in more than 30 languages\"?":"Yahoo!","What company developed a blood pressure cuff that completely automates the process by plugging it into an iPhone?":"Withings","What company has created a smart contact lens with an embedded microchip that monitors intracular pressure?":"Sensimed","What company hosts a website called Legalize LA that advocates immigration reform?":"American Apparel","What company is working on technology that incorporates a tiny sensor into pills for targeting medication adherence?":"Proteus Biomedical","What completes this: \"FQDN is Fully Qualified ___ Name\"?":"Domain","What completes this: In Java, related classes are grouped into ___?":"Packages","What completes this: a Boolean expression will be either ___ or ___?":"True/False","What computer language automatically frees (deallocates) memory for you after it's no longer needed?":"Java","What computing term was born when engineers removed a dead moth from a relay in a Mark II computer?":"Debugging","What creates the distinct nature of the land in deserts? ":"Lack of rainfall","What deal-of-the-day website features discounted gift certificates usable at local or national companies?":"Groupon","What device is thought to have been developed around 3500BC, in Mesopotamia?":"Wheel","What do FLOPS measure?":"Processor Speed","What do Yew, Laburnum Seeds & Mistletoe berries have in common? ":"They are poisonous","What do antioxidants neutralize?":"Free radicals","What do beavers eat?":"Herbivorous items","What do botanists study?":"Plants","What do distributed computing systems do?":"Filter and analyze data","What do food chains always start with? ":"Producer","What do scientists use the Beaufort scale to measure?":"Wind speed","What do the first two letters in the name of the company \"VMWare\" represent?":"Virtual Machine","What do the letters \"EEG\" stand for?":"Electroencephalogram","What do the long straight lines represent in a circuit diagram? ":"Wires","What do these things have in common: Nacreous, Noctilucent, Fibratus, Intortus?":"Cloud types","What do we call 1 single piece of coiled DNA?":"Chromosome","What do we use to measure electric current? ":"Amperes","What does Bcc mean?":"Blind Carbon Copy","What does Science say (via genetic studies) about when on the evolutionary timeline, primates diverged from other mammals?":"85 million years ago","What does TCP stand for?":"Transmission Control Protocol","What does UDP stand for?":"User Datagram Protocol","What does VPN stand for?":"Virtual Private Network","What does a \"502\" HTTP Status Message indicate?":"Bad Gateway","What does a Pascal unit measure?":"Pressure","What does a barometer measure?":"Air Pressure","What does a nidoligist study?":"Bird nests","What does an SSL certificate do?":"Validates website authenticity","What does e-tailing refer to?":"Virtual storefront","What does ice do in water? ":"Floats","What does kWh stand for? ":"Kilowatt hours","What does the \"B\" in BASIC stand for?":"Beginner's","What does the \"RS\" in RS-232 stand for?":"Recommended Standard","What does the Alexander Arrangement actually arrange?":"Elements of the periodic table","What does the Becquerel unit measure?":"Radioactivity","What does the Hertz unit measure?":"Frequency","What does the Internet abbreviation URL stand for?":"Uniform Resource Locator","What does the Olf unit measure?":"Smell","What does the Pauling scale (named after Linus Pauling) measure?":"Electronegativity","What does the Windows Naming Service (WINS) resolve?":"Computer names to IP addresses","What does the acronym \"pixel\" refer to?":"Picture element","What does the acronym LCD stand for?":"Liquid Crystal Display","What does the bitcoin lack that leads to the uncertatinty of its future values?":"Economic anchor","What does the datatype 'int' indicate in C?":"Integer","What does the filament in a cathode ray tube emit?":"Electrons","What does the prefix \"nano\" mean?":"One billionth","What does the term \"immutable\" mean, as related to a String object's value in Java?":"It cannot be changed","What does the term GPF mean?":"General Protection Fault","What does the term for SaaS architecture, \"Single tenant\", refer to?":"Private cloud","What element does every organic chemistry compound contain?":"Carbon","What element has the greatest electronegativity (Χ)?":"Fluorine","What element is named for a US state or, more precisely, for a university in that state?":"Californium","What error generally occurs when a program tries to access data in an inappropriate part of memory or even the OS?":"General Protection Fault","What event marks the longest day for sunlight in the NORTHERN hemisphere?":"Summer solstice","What famous algorithm was invented by James Cooley and John Tukey?":"Fast Fourier Transform","What famous physicist proposed his theory of the Photoelectric effect in 1905, which won him a Nobel prize?":"Albert Einstein","What famous seed funding firm co-founded by Paul Graham is named after a construct in functional programming?":"Y Combinator","What feature is new to C++11 that was not in either C or C++? ":"All listed items","What feature of Peercoin, a cryptocurrency, differs from the rest?":"No hard limit","What feature of Sony video game consoles allows compatible home console games to be played on the handheld?":"Remote Play","What field of study relates the calculation of relative quantities of reactants and products in chemical reactions? ":"Stoichiometry","What first step might a C++ void pointer need, to be dereferenced?":"Explicit cast to another type","What foreseen implementation in social media will be a true breakthrough in how businesses market and sell to consumers?":"One-click purchase button","What form of advertisement will benefit from increased use of location data gathered from users?":"Search advertisement","What fruit is this?":"Banana","What function, used in C++ classes, closes out the objects when they go out of scope?":"Destructor","What gas do plants emit as a by-product of photosynthesis? ":"Oxygen","What geometric shape is the cross-section of an Allen Key?":"Hexagon","What happens to a person's mass on the Moon? ":"Stays the same","What happens when 2 (or more) atoms form chemical bonds with each other?":"Molecules are made","What happens when a piece of plastic becomes negatively charged? ":"Gains electrons","What happens when stress accumulates along the boundary of any of Earth's lithospheric plates?":"Earthquakes","What hardware device or software application acts to keep malicious forces away from your Internet devices?":"Firewall","What holds the address of the first item in a linked or other dynamically allocated list?":"Head pointer","What human illness is caused by the body's inability to fully process sugar?":"Diabetes","What in the world is a guyot?":"Undersea volcanic mountain","What in the world is an asterism?":"Star patterns seen from Earth","What instant-messaging platform was founded by Jan Koum and Brian Acton?":"WhatsApp","What instrument is used for measuring humidity?":"Hygrometer","What instrument is used to measure atmospheric pressure":"Barometer","What is DNS an acronym for?":"Domain Name Service","What is DOS an acronym for?":"Disk Operating System","What is EMACS an example of?":"Text editor","What is GNU a recursive acronym for?":"GNU's not Unix","What is Google's unofficial slogan?":"Don't be evil","What is HTTP's well known port number?":"80","What is IRC, which normally connects to port 6667, an acronym for?":"Internet Relay Chat","What is Mozilla's Thunderbird software an instance of?":"Email client","What is NOT a characteristic of a cloud service?":"Device and location dependence","What is NOT an example of a circuit-switched network?":"Internet","What is a C++ function that calls itself during execution?":"Recursive","What is a Galileo thermometer also called?":"Thermoscope","What is a bird’s \"gizzard\"?":"Its second stomach","What is a cambium?":"A plant layer","What is a car that is equipped with Internet access called?":"Connected car","What is a data type used to represent a single true or false value?":"Boolean","What is a digital delivery?":"Downloading of online goods","What is a drink with no C₂H₅OH called?":"Non-alcoholic","What is a fear of thunder and lightning called? ":"Astraphobia","What is a frond?":"Leaf of a fern","What is a honeypot?":"Malware deflection technique","What is a malicious program that is disguised as legitimate software?":"Trojan Horse","What is a piece of glass with a sample to look at under a microscope? ":"Slide","What is a rhizoid?":"Moss to soil anchoring fibers","What is a standardized networking protocol used by servers on an IP network to allocate IP addresses to computers?":"DHCP","What is a term meaning to convert one data type to another?":"Cast","What is a term some online magazines distributed through the World Wide Web use to call themselves?":"Webzines","What is acoustics?":"The study of sound","What is an \"electronic advocacy\" also known as?":"Internet activism","What is an Ishihara test used for? ":"Color perception","What is an e-web-store also known as?":"Online shopping","What is an error condition that occurs during the execution of a Java program?":"Exception","What is an example of a packet-switched network?":"Internet","What is another name for a visceral muscle?":"Smooth","What is another name for the vitamin B1?":"Thiamine","What is another name for vitamin C?":"Ascorbic acid","What is another term for \"bespoke\" software?":"Custom","What is another term for looping?":"Iteration","What is classified by the ABO system?":"Blood","What is code that is used during program development to assist with debugging?":"Scaffolding","What is cytoplasm found inside? ":"Cells","What is fossilized tree resin called? ":"Amber","What is generated when a magnet is repeatedly moved in and out of a coil of wire in a closed circuit? ":"Alternating current","What is homichlophobia the fear of?":"Fog","What is mayonnaise an example of? ":"An emulsion","What is oftentimes referred to as a new media?":"A technology that is digital","What is phloem?":"Plant transport tissue","What is removed during an appendectomy?":"Appendix","What is the \"brain\" of the computer that performs instructions defined by software?":"CPU","What is the IEEE working group for wireless local area networks?":"802.11","What is the R programming language well suited for?":"Graphical statistical models","What is the SI unit of electrical charge?":"Coulomb","What is the SI unit of electrical current?":"Ampere","What is the SI unit of electrical resistance?":"Ohm","What is the SI unit of force?":"Newton","What is the SI unit of frequency? ":"Hertz","What is the abbreviation for \"Knowledge Discovery in Databases\"?":"KDD","What is the abbreviation for \"distributed denial of service\"?":"DDoS","What is the acronym for the protocol used to manage network devices on an IP network?":"SNMP","What is the basic term for a set of parallel wires that allow bits to be transmitted over it?":"Bus","What is the basic unit of electromotive force? ":"Volt","What is the basic unit of resistance? ":"Ohm","What is the body's main source of energy?":"Carbohydrates","What is the character limit for each \"tweet\" on Twitter?":"140","What is the charge on a proton? ":"Positive","What is the chemical name for common table salt?":"Sodium chloride","What is the chemical symbol for Antimony?":"Sb","What is the chemical symbol for Chromium?":"Cr","What is the chemical symbol for Potassium?":"K","What is the chemical symbol for Sodium?":"Na","What is the chemical symbol for Tin?":"Sn","What is the chemical symbol for Titanium?":"Ti","What is the chemical symbol for copper?":"Cu","What is the chemical symbol for gold?":"Au","What is the closest star to the Earth?":"The Sun","What is the color of a ruby?":"Red","What is the effect of deforestation on carbon dioxide levels in the atmosphere? ":"Increase","What is the estimated construction cost for a passenger-only version of the hyperloop system?":"$6 billion","What is the first hands-free breastfeeding guidance application being created called?":"Breastfeeding #ThroughGlass","What is the fourth planet from the Sun?":"Mars","What is the future value of bitcoin said to be?":"Highly volatile","What is the general name for an organism that can use energy from sunlight to produce organic compounds?":"Autotroph","What is the general name for an organism that cannot fix carbon itself, but does use organic carbon for growth?":"Heterotroph","What is the gravitational acceleration of Earth?":"9.8 m/s²","What is the group of minerals chemically containing hydrocarbons called?":"Organic group","What is the informal term that refers to the earliest geologic evolution of the Earth and Moon?":"Cryptic","What is the largest moon of Jupiter called?":"Ganymede","What is the longest day of the year?":"The summer solstice","What is the main focus of software quality assurance?":"Prevention","What is the major type of cell in the epidermis skin layer, producing a fiberous protein to aid body protection?":"Keratinocyte","What is the maximum number of wisdom teeth the average adult has?":"4","What is the middle of an atom called? ":"Nucleus","What is the minimum requirement to restore a lost bitcoin wallet?":"A private key","What is the most common blood group in Europe?":"O+","What is the most common blood type in humans?":"O","What is the most common rock found on Earth?":"Basalt","What is the most popular social media platform to date?":"Facebook","What is the name for an organism that obtains nutrients by consuming decomposing plant or animal parts?":"Detritivore","What is the name for the ray of light (noted as P) shined at the mirror?":"Incident ray","What is the name for the science that studies the solid Earth?":"Geology","What is the name for the transparent front part of the eye? It covers the pupil, and iris.":"Cornea","What is the name given to background processes in Unix environments that do not accept any direct user input?":"Daemon","What is the name given to something that uses electricity to make it magnetic? ":"An electromagnet","What is the name of OS X's native API?":"Cocoa","What is the name of Saturn’s largest moon?":"Titan","What is the name of a single dot on a computer monitor screen? ":"Pixel","What is the name of a software tool that monitors data flowing over computer network links?":"Sniffer","What is the name of the 3 leafed clover associated with St Patrick's day in Ireland? ":"Shamrock","What is the name of the algorithm created by Larry Page and Sergey Brin that ranked websites using data about links between them?":"PageRank","What is the name of the branch in geology that studies rock layers and rock layering?":"Stratigraphy","What is the name of the model for distributed computing that partitions task between resource providers and service requestors?":"Client Server","What is the name of the physical phenomenon observed when a prism splits white light into its constituent colors?":"Dispersion","What is the name of the positively charged ion that results when an atom loses an electron?":"Cation","What is the name of the pressure that forces electrons to flow through a circuit? ":"Voltage","What is the name of the printed circuit board on which the CPU and RAM chips?":"Motherboard","What is the name of the sugar produced by photosynthesis? ":"Glucose","What is the name of the tiny icon that represents any open webpage in the tab of a web browser?":"Favicon","What is the name of the warm air currents used by gliders or parasailers?":"Thermals","What is the name used for a material that retains its strength at high temperatures (mostly above 1,000 °F - 811 K - 538 °C)?":"Refractory","What is the network mask for this prefix: 192.168.1.0/24 ?":"255.255.255.0","What is the nickname for the Earth's oldest known nesosilicate mineral, having the chemical formula, ZrSiO₄?":"Zircon","What is the nominal output voltage of an alkaline AA battery?":"1.5 volts","What is the number system that uses the digits 0-9 and the letters A-F?":"Hexadecimal","What is the only function all C++ programs must contain?":"main()","What is the open-source implementation of SMB called?":"Samba","What is the opposite of alkaline? ":"Acid","What is the other name used for Reverse Polish notation?":"Postfix notation","What is the part of the Earth, and thin layer of air above its surface which support life?":"Biosphere","What is the practice of logically dividing a visible network into 2 or more networks called?":"Subnetting","What is the precursor to Internet forums?":"Usenet","What is the process of adding transaction records to bitcoins by computers called?":"Mining","What is the process of analyzing strings of symbols, either in natural or computer languages, according to grammar rules called?":"Parsing","What is the process of assigning an IP address for a specific duration of time to various DHCP hosts called?":"Leasing","What is the process of encoding information in such a way that only authorized parties can read it called?":"Encryption","What is the process of fracturing rock by a pressurized liquid called?":"Fracking","What is the process used by plants and other organisms to convert light energy called?":"Photosynthesis","What is the purpose of the drug lovastatin?":"Lower cholesterol","What is the rarest of the four blood types?":"AB","What is the reaction between compounds and oxygen called?":"Oxidation","What is the scientific name for laughing gas?":"Nitrous oxide","What is the second biggest bone in the body?":"Tibia","What is the second largest rodent in the world?":"Beaver","What is the second most commonly used language on the Internet, with English at the top of the list?":"Chinese","What is the service called whereby a customer collects an item from the dark store they have ordered online?":"Click-and-collect","What is the size of a UDP header?":"8  bytes","What is the software powering Google's automatous cars called?":"Google Chauffeur","What is the speed of light?":"299,792,458 m/s","What is the study of anesthesia and anesthetics called?":"Anesthesiology","What is the study of animal biology?":"Zoology","What is the surface point of an earthquake called?":"Epicenter","What is the term for a routine that is called as part of an expression and returns a value?":"Function","What is the top number in a fraction called?":"Numerator","What is the top search engine on the Internet?":"Google","What is the top web browser in the US?":"Google Chrome","What is the use of computers and computer networks to promote political ends, chiefly free speech, and the likes, called?":"Hacktivism","What is the use of the Internet to deliver medical services called?":"Cybermedicine","What is the version of Unix built by Hewlett-Packard?":"HP-UX","What is used to test for carbon dioxide?":"Limewater","What is used to treat a rattlesnake bite?":"Antivenom","What is xylem?":"Plant transport tissue","What job position did the renowned Steve Jobs hold in technology company, Apple?":"Chief Executive Officer","What kind of animal is a summer tanager?":"Bird","What kind of data structure is a HEAP?":"Tree","What kind of processor was the SPARC, created by Sun Microsystems?":"RISC","What kind of star is our sun?":"Yellow Dwarf","What law is this: F = G (m₁ × m₂) ÷ r²":"Newton's Universal Gravitation","What leg bone is the largest bone in the human body?":"Femur","What limits the current flowing through a circuit for an applied DC voltage? ":"Resistance","What lives in a formicarium?":"Ants","What makes plants green? ":"Chlorophyll","What mammal is the slowest in the world?":"Sloth","What method is widely used on websites to distinguish between human and non-human visitors to the site?":"CAPTCHA","What name are scientists who study weather known by?":"Meteorologists","What name is given to a body's ability to store electrical charge?":"Capacitance","What name is given to a member function in a struct or class that initializes the object, and prepares it for use?":"Constructor","What name is given to animals that undergo all embryonic development inside the body of the mother?":"Viviparous","What name is given to animals that undergo all embryonic development outside either of their parent's bodies?":"Oviparous","What name is given to the celestial event whereby the Moon appears to move across the face of the Sun?":"Solar eclipse","What name is given to the level (or position) an organism occupies in the food chain?":"Trophic","What network allows people to connect with others who have the same condition and track and share their own experience?":"PatientsLikeMe","What notation is used in the discussion of the running time complexity of algorithm?":"Big O Notation","What online grocery store and delivery services offers over 300 grocery products, including award winning milk and chocolate milk?":"Winder Farms","What online magazine was intended for professional web designers, web developers and those who practice information architecture?":"Digital Web","What other name would a dentist call any wisdom tooth?":"3rd Molar","What part of a plant attracts bees? ":"Flower","What part of the sun is visible as a result of a total solar eclipse?":"Corona","What particle of the atom determines the type of element?":"Proton","What percent of jellyfish is water?":"95%","What philosophical consideration suggests that the physical universe must be compatible to those lifeforms that can observe it?":"Anthropic principle","What prefix denotes a magnitude of one billion in the metric system?":"Giga","What probably caused the dinosaurs to go extinct? ":"A meteor","What problem does sulphur dioxide cause? ":"Acid rain","What programming language would a servlet be written in?":"Java","What pseudonym is used to refer to the developer of the bitcoin software?":"Satoshi Nakamoto","What relationship would a decibel have to a bel? Both are units of sound intensity or power.":"Decibel is 1/10th of a bel","What role does a tick play if it bites a deer with the Lyme disease bacteria, then bites a human being, infecting them?":"Vector","What scientist was instrumental in formulating the theory of evolution by natural selection? ":"Charles Darwin","What segment separator is used for IPv6 (Normal) addresses?":":","What simple computing language was designed in 1964?":"BASIC","What sort of organisms can be genetically engineered? ":"Plants and animals","What species, aka Pinus Longaeva, is the world's oldest living non-clonal organism (tree) on Earth?":"Great Basin Bristlecone Pine","What spider has venom that is regarded as the world's most deadly?":"Brazilian wandering spider","What substances can convection happen within? ":"Liquids and gases","What term describes 2 nuclides that have the same number of protons, but a different number of neutrons?":"Isotope","What term describes the balancing of water molecules from higher to lower pressure, across a semi-permeable membrane?\t":"Osmosis","What term is used for identifiers that have an uppercase letter for each lowercase word, as in: CalculateSumValues?":"Camel case","What term is used to define the scarcity in the pool of as yet, unallocated IPv4 address?":"IPv4 address exhaustion","What term is used to denote 1024 gigabytes?":"Terabyte","What term is used to denote four bits?":"Nibble","What term is used to denote the preparing of a data storage medium for use (which also deletes all data present on it)?":"Formatting","What term is used to describe the usually deliberate writing of valid code in an almost human-unreadable manner?":"Obfuscation","What term means the ability (in programming) to present the same interface for different underlying forms (data types)?":"Polymorphism","What term refers to the number of signal wires or lines allocated to the bus?":"Bus Width","What term refers to the production of a current in a conductor moving through a magnetic field?":"Induction","What term was created by marketing companies to persuade people to shop online?":"Cyber Monday","What term would a physicist use to define the energy possessed by matter as a result of its motion?":"Kinetic energy","What term would be defined as \"the action of getting the data \"pointed to\" from a pointer variable\"?":"Dereference","What theorem tells the max rate data can be transmitted over a comm channel of a specified bandwidth in the presence of noise?":"Shannon-Hartley","What theoretical construct is composed of the following: a tape, a reading head, an action table, and a state table?":"Turing Machine","What tool is used in the Vickers hardness test?":"Nanoindenter","What tool is used to measure the angles of a ship's propeller blades?":"Pitchometer","What traditional IT company is the largest big data vendor in the world?":"IBM","What type of animal is a beaver?":"Rodent","What type of connection uses a RJ45 pin connector?":"Ethernet","What type of device is a solenoid?":"Electromagnet","What type of falling fruit is said to have inspired Newton to formulate his theory of gravity?":"Apple","What type of glaciers are the largest?":"Continental glaciers","What type of map is this?":"Choropleth","What type of network address space is not globally delegated, ie addresses are not allocated to any specific organization/person?":"Private","What type of nuclear reaction fuels the Sun?":"Nuclear fusion","What type of process occurs in which a programmatic function calls itself as a subroutine?":"Recursion","What type of program was VisiCalc, one of the most famous software products of the 70s?":"Spreadsheet","What type of species (or organism) are humans?":"Diploid","What type of technology is \"Kerberos\"?":"Authentication","What university's \"Huggable\" teddy bear robot can serve as a medical communicator for children?":"MIT","What upcoming virtual reality head-mounted display is being developed by virtual reality technology company, Oculus VR?":"Oculus Rift","What value is represented by the subscript ₓ in the location noted here, for the element Argon: ₓAr ":"Atomic number","What value is represented by the superscript ˣ in the location noted here, for the element Argon: ˣAr ":"Atomic mass","What videotex online service was introduced nationwide in France in 1982 by former France Télécom?":"Minitel","What was Google Shopping, a Google service, originally known as?":"Froogle","What was NOT the name of a US space mission?":"Scout","What was first detected near the Savannah River (USA) nuclear reactor in 1956?":"Antineutrinos","What was the codename of Windows 95?":"Chicago","What was the estimated amount of data in the healthcare realm in 2012?":"50 petabytes","What was the first character set coding technique using 5 bits/character, and predates both EBCDIC and ASCII?":"Baudot Code","What was the first human species to use stone tools?":"Homo Habilis","What was the first item to be purchased with bitcoins?":"A pizza","What was the first object created by people that produces a sonic boom?":"Bullwhip","What was the first video ever to be uploaded to video-sharing website, YouTube?":"Me at the zoo","What was the first web browser called?":"WorldWideWeb","What was the floor area of ENIAC, the worlds first electronic computer?":"167 m² (1,800 feet)","What was the name of the driverless public road transport system which became operational in the Netherlands in the early 2000s?":"ParkShuttle","What was the name of the first cloned mammal?":"Dolly the sheep","What was the name of the first digital computer?":"ENIAC","What was the name of the network that was the predecessor to the Internet?":"ARPANET","What was the name of the supercomputer that defeated chess master Garry Kasparov in 1997?":"Deep Blue","What was the number of the last Apollo mission?":"17","What was the slogan for YouTube between the years 2005, and 2012?":"Broadcast Yourself","What wellness app allows its employees to earn points by completing different challenges like meditating or taking a health quiz?":"Keas","What will two particles of different charges do? ":"Attract","What word describes the \"zero time and date\" in an OS?":"Epoch","What word is missing from this movie title: “The ___ Of Oz”?":"Wizard","What word, associated with email, comes from a Monty Python sketch about a menu?":"Spam","What would be the best equipment for sampling organisms in a pond? ":"Sweep net","What's X! if X = 4?":"24","What's a data type used for any positive or negative number without a decimal point?":"Integer","What's a typical graphical Java program that runs in a web browser or viewer?":"Applet","What's the common name of the animal known as \"vulpes vulpes\"?":"Fox","What's the first geologic eon of Earth, spanning 600 million years, from 4.6 billion to 4 billion years ago?":"Hadean","What's the name for a protein that can \"misfold\" into multiple forms; then transmit the misfolding data to other healthy proteins?":"Prion","What's the name for the type of statement bracketed with a {}?":"Block","What's the name of the formation that hangs from the ceiling of caves?":"Stalactites","What's the name of the formation that rises up from the floor of caves?":"Stalagmites","What's the ocean transition layer where temperature changes more rapidly with depth than it does in the layer above or below it?":"Thermocline","When 2 of Earth's plates come together, what type of plate boundary is formed?":"Convergent","When 2 of Earth's plates move away from each other, what type of plate boundary is formed?":"Divergent","When NaCl is mixed with H₂O, what happens to it?":"Disassociates into ions","When a male and a female gamete join what happens? ":"Fertilization","When an oxygen-deficient explosive mixture of TNT/RDX is detonated in a closed chamber, what results?":"Nanodiamonds","When considering data latency, which of the following is NOT an important factor?":"Job vacancies","When electricity passes through the body it is known as a what? ":"Electric Shock","When one or more loops is placed inside another loop, it is known as what type?":"Nested","When somebody is e-mail bombing, what is he doing?":"Sending mass e-mails","When someone breathes in radioactive radon gas, we say they have been what? ":"Contaminated","When two plastic rods are rubbed and brought together, they attract due to what? ":"Opposite charges","When you crank up the volume on your Led Zeppelin CD, what are you changing about the sound waves?":"Their amplitude","When, primarily, does a beaver sleep?":"Daytime","Where can lemurs be found?":"Madagascar","Where do most primates, apart from humans, prefer to live?":"In trees","Where does most electricity in the United States come from? ":"Fossil fuels","Where in Europe is the Barbary macaque most likely found?":"Gibraltar","Where in the body is the patella?":"Knee","Where in the human body do you find \"aqueous humour\"?":"Eye","Where in your bathroom are you most likely to find acetone?":"Nail polish remover","Where in your body would you find the rods and cones?":"Eyes","Where is most life on Earth? ":"In the sea","Where is the axillary temperature taken?":"Armpit","Where is the gluteus maximus located?":"The buttocks","Where is the strength of Earth's gravity the weakest?":"In an airplane 12km high","Where is the world's deepest mine, which also happens to be the deepest man has descended into the Earth?":"South Africa","Where was Ethernet developed in 1973 and 1974?":"Xerox Parc","Where would you find a magnetosphere?":"Around the Earth","Where would you find a valence shell?":"In an atom","Where would you find most of the iron in your body?":"In your blood","Where would you find the \"Mohorovicic discontinuity\", nicknamed the \"Moho\" by seismologists?":"Underground","Where would you find the substance chlorophyll?":"Plants","Where would you find your fovea centralis?":"Eye","Where, in a household, would you find a magnetron?":"In a microwave oven","Which 2 sub-atomic particles are typically found in the atomic nucleus?":"Proton & Neutron","Which American-based fashion, style and beauty website, founded by Justin Philippe, follows a newsletter format?":"Refinery29","Which Canadian online magazine's target audience is women aged 19-34, and also partnered with Yahoo! Canada?":"Divine.ca","Which Danish physicist won the Nobel Prize for Physics in 1922?":"Niels Bohr","Which Dennis Ritchie programming language was originally called \"The New B\"?":"C","Which European country has sent the most people into space?":"Germany","Which European country has the most nuclear power plants?":"France","Which GUI design form element allows users to pick only one from a set of options?":"Radio Button","Which Java-based Apache tool is used for automating build processes in Java projects?":"Ant","Which Linux distribution gets its name from an African cultural concept which means \"humanity towards people\"?":"Ubuntu","Which NCSA program is considered to be the first modern web browser?":"Mosaic","Which South African owns Canonical Ltd., the company behind Ubuntu?":"Mark Shuttleworth","Which UNIX derivative was created by Andrew Tanenbaum, a computer science professor, for teaching purposes?":"MINIX","Which US Defense project is considered the precursor to the Internet?":"ARPANET","Which alternative to 'copyright' used particularly in open source software requires that derivatives be as free as the original?":"Copyleft","Which auto enthusiast website is widely considered to be the largest Corvette enthusiasts' club in the world?":"CorvetteForum","Which automotive pricing and information website, founded in 2005, is about new and used car buyers and dealers?":"TrueCar","Which bird has a record 25,000 feathers?":"Swan","Which character did not make an appearance in \"Ultimate Marvel Vs Capcom 3\"?":"Blanka","Which character encoding method was invented by Ken Thompson and Rob Pike":"UTF-8","Which cluster of stars is also known as the Seven Sisters?":"Pleiades","Which coalition includes a group of governments committed to advance Internet freedom?":"Freedom Online Coalition","Which common animal is scientifically known as \"Mus musculus\"?":"Mouse","Which community powered social commerce website has active communites around fashion, interior design and artistic expression?":"Polyvore","Which company acquired ShopStyle, a fashion shopping search engine, in 2007?":"PopSugar","Which company collaborated with Microsoft to build OS/2?":"IBM","Which company created the now widely used SSL Protocol?":"Netscape","Which company named IEEE 1394 FireWire?":"Apple","Which company offers online real-time restaurant-reservation service, founded by Chuck Templeton?":"OpenTable","Which company sold the Amiga series of PCs?":"Commodore","Which company started online in 2007, and is a gifting retailer specialising in hand-iced biscuits, chocolates and cakes?":"Biscuiteers","Which computer engineer was often referred to simply by his username 'dmr'?":"Dennis Ritchie","Which computer innovator has written books such as \"The Age of Spiritual Machines\"?":"Ray Kurzweil","Which computer language is most closely linked with Flash?":"ActionScript3","Which computer language made extensive use of \"turtle graphics\"?":"Logo","Which computer language's creation was Grace Hopper involved in?":"COBOL","Which computer programmer is often referred to by the nickname \"RMS\"?":"Richard Stallman","Which computer programming term is also the name of Apple's headquarters in Cupertino, California?":"Infinite Loop","Which computer scientist at the British crypto-analysis base at Bletchley Park was nicknamed \"Prof\"?":"Alan Turing","Which computer scientist gives his name to a computer architecture model for a stored program?":"John von Neumann","Which computer scientist is credited with coining the term \"Artificial Intelligence\"?":"John McCarthy","Which computer scientist is famous for the phrase \"The best way to predict the future is to invent it\"?":"Alan Kay","Which computer typesetting system did Donald Knuth create?":"TeX","Which constellation of stars is also known as \"The Hunter\"?":"Orion","Which contemporary of Charles Babbage is often called the world's first computer programmer?":"Ada Lovelace","Which corporation, founded in February 1994, pioneered the field of consumer health information and communities on the Internet?":"MedHelp","Which country introduced the worlds first diesel locomotive in 1912?":"Germany","Which cryptocurrency is a proposed extension to the bitcoin protocol that would add true cryptographic anonymity?":"Zerocoin","Which data structure was invented by G. M. Adelson-Velskii and E. M. Landis?":"AVL Tree","Which database product was built by Scandinavians David Axmark, Allan Larsson and Michael Widenius?":"MySQL","Which datatype in Java is named after a mathematician and has values \"true\" and \"false\"?":"Boolean","Which demographic age group of cell phone users have the most number of downloads of health-related apps on their phones?":"18-29","Which doctor demonstrated the first concepts for Google Glass in the field of interventional radiology?":"Dr. Phil Haslam","Which does NOT pertain to a VPN?":"State Machine","Which electronic commerce website is the world's largest online grocery retailer?":"Tesco.com","Which element has the atomic number 1 and comes first on the Periodic Table?":"Hydrogen","Which element has the atomic number 3?":"Lithium","Which element is present in all organic compounds?":"Carbon","Which element, named after a country, has the atomic number 32?":"Germanium","Which elemental gas makes up roughly 78% of the earth's atmosphere?":"Nitrogen","Which environment is the driest on Earth? ":"Tundra","Which famed activist has stated that \"the Internet doesn't do a very good job of motivating action\"?":"Ralph Nader","Which famous Greek philosopher devised a now well-recited theorem about the relationship of a right triangle's 3 sides?":"Pythagoras","Which famous computer innovator created NeXT?":"Steve Jobs","Which famous piece of code, first used in C by Brian Kernighan, is usually written when trying out a language?":"Hello, World","Which fashion blog run by Chiara Farragni became successful fairly quick after its launch, receiving over 110,000 hits daily?":"The Blonde Salad","Which fashion blog was founded by Araz Fazaeli, and is considered the first street fashion blog of Iran?":"The Tehran Times","Which fashion website was formerly the online site for the fashion magazine Vogue?":"Style.com","Which fashion website was launched by New York-based, interactive technology company, Entertainment Media Works in 2004?":"Star Style","Which file extension notes an executable file?":".exe","Which file type is NOT closely associated with webpages?":"NPC","Which formal mathematical system was formulated by Alonzo Church?":"Lambda calculus","Which foundation created and maintains the Firefox browser?":"Mozilla","Which foundation, founded in March 2008, has a social networking platform, TuDiabetes, meant for people touched by diabetes?":"Diabetes Hands Foundation","Which gas in the atmosphere absorbs ultraviolet rays?":"Ozone","Which general-purpose programming language was invented by \"Matz\" Matsumoto?":"Ruby","Which home grocery delivery service is a subsidiary of the e-commerce company, Amazon.com?":"AmazonFresh","Which human activity might use the Lamaze technique?":"Childbirth","Which insect transmits many different deadly diseases and through transmission, kills about 725,000 people a year?":"Mosquito","Which instrument would you use to measure electric potential? ":"Voltmeter","Which instrument would you use to measure resistance? ":"Ohmmeter","Which intermediate form are Java programs compiled to?":"Bytecode","Which international organization was founded in 1992 to provide leadership in Internet related standards, education, and policy?":"Internet Society","Which is NOT a CPU addressing scheme?":"Physical","Which is NOT a determinate of disk access time?":"Non-Rotational delay","Which is NOT a lepton?":"W⁺","Which is NOT a moon of Saturn?":"Triton","Which is NOT a nucleobase?":"Taumerine","Which is NOT a valid HTTP Status Message?":"All are valid","Which is a good example of a detritivore?":"Earthworm","Which is a halogen element?":"No listed answer","Which is a method of interprocess communication under Microsoft Windows?":"Dynamic Data Exchange","Which is a nucleobase found in both human DNA and RNA?":"Guanine","Which is an example of infix notation?":"S = 3 + 3","Which is an example of postfix notation?":"S = 8 3 +","Which is an example of prefix notation?":"S = + 5 7","Which is not an igneous rock?":"Schist","Which is the approximate radial distance from Earth's center to the equator?":"6,401 km","Which is the chemical formula for hydrogen peroxide?":"H₂O₂","Which is the chemical formula for ozone?":"O₃","Which is the default port an HTTP-based web server listens to?":"80","Which is the largest planet in our solar system?":"Jupiter","Which is the most abundant protein in the human body?":"Collagen","Which is the most common gas in the atmosphere?":"Nitrogen","Which is the most common isotope of hydrogen?":"Protium","Which is true about halogen elements?":"Monovalent","Which key programming language was built by IBM in the 1950s for scientific computing?":"Fortran","Which language was created by Booch, Jacobson, and Rumbaugh?":"UML","Which language was created for use in mathematical and scientific computing by Cleve Moler?":"MATLAB","Which language was once known as Oak, and then Green?":"Java","Which linguist greatly influenced theoretical computer science with such models as a hierarchy of formal grammars?":"Noam Chomsky","Which liquid does a flower produce to attract insects? ":"Nectar","Which lowercase Greek letter is an unofficial symbol of the field of programming language theory?":"λ (lambda)","Which machine did Charles Babbage design to calculate values of polynomial functions?":"Difference Engine","Which material is NOT a synthetic?":"Angora","Which mathematics software was created by the British scientist Stephen Wolfram?":"Mathematica","Which metal is named after Cyprus where it was mined in the Roman era?":"Copper","Which methods are used to discover new exoplanets, or re-detect already discovered ones?":"All listed answers","Which network security expert is known for algorithms such as \"Skein\", \"Twofish\", and \"Blowfish\"?":"Bruce Schneier","Which of his inventions does Sir Tony Hoare dub his \"billion dollar mistake\"?":"Null pointers","Which of the 4 human nucleobases differs in DNA and RNA?":"Thymine in DNA, Uracil in RNA","Which of the 4 human nucleobases is typically only found in DNA, and not RNA?":"Thymine","Which of the following acquired Instagram?":"Facebook","Which of the following advocacy networking sites is meant for youths?":"Global Youth Action Network","Which of the following animals are not rodents?":"Hedgehogs","Which of the following animals is believed to be the first to be domesticated?":"Dog","Which of the following are NOT a planetary wind?":"Drainage winds","Which of the following are VPN tunneling protocols?":"All of these","Which of the following are protocols used for email applications?":"All choices","Which of the following biological classifications is the broadest?":"Class","Which of the following biological classifications is the narrowest?":"Genus","Which of the following biomes is the wettest? ":"Rainforest","Which of the following celebrities leveraged social media for social good by donating $1 million through a partnered contest?":"Lady Gaga","Which of the following companies is an online distributor of television-quality web shows, Hollywood movies, and TV shows?":"Crackle","Which of the following e-commerce websites focuses on handmade or vintage items, and supplies?":"Etsy","Which of the following electronic commerce companies is the world's largest online retailer?":"Amazon.com","Which of the following energy sources adds to the greenhouse effect? ":"Oil","Which of the following fashion blogs is created by Scott Schuman in New York?":"The Sartorialist","Which of the following fashion websites was the first fashion site on the Internet?":"Fashion Net","Which of the following features are NOT found in animal cells?":"Cell walls","Which of the following free online music streaming services allows users to create and share custom radio stations?":"Jango","Which of the following free software e-learning platforms is also known as a \"virtual learning environment\"?":"Moodle","Which of the following global online food delivery marketplace was launched in March 2012, in Singapore?":"Foodpanda","Which of the following has a prokaryotic cell type?":"Bacteria","Which of the following helps to distribute seeds such as acorns to new places? ":"Squirrels","Which of the following insects can fly at a speed of around 96 km/h (60 mph)?":"Dragonfly","Which of the following is NOT a Knowledge Discovery in Databases process stage?":"Planning","Which of the following is NOT a complementary network technology used for mobile data offloading?":"Gargaucell","Which of the following is NOT a form of mass media?":"A personal diary","Which of the following is NOT a language web designers have as a working knowledge?":"Linguistics","Which of the following is NOT a serial communications architecture?":"MicroChannel","Which of the following is NOT a way to obtain bitcoins?":"Purchasing from bank","Which of the following is NOT an area Facebook marketers will refocus their efforts on, in 2014?":"Spam the news feed","Which of the following is NOT true of organic sulfur compounds called thiols or mercaptans?":"Used as an air freshener","Which of the following is a bird AND a fruit?":"Kiwi","Which of the following is a metal that will not rust or corrode?":"Gold","Which of the following is a renewable energy resource? ":"Geothermal power","Which of the following is not a Java primitive data type?":"string","Which of the following is one of the United Kingdom's largest online-only fashion and beauty stores, founded in June 2000?":"ASOS.com","Which of the following is the process of preventing and correcting problems in the way that data is entered and stored?":"Data cleaning","Which of the following is tropical grassland?":"Savanna","Which of the following mammals cannot jump?":"Elephant","Which of the following metals is in a liquid state at room temperature":"Mercury","Which of the following multinational Internet consumer-to-consumer corporations was founded by Pierre Omidyar in 1995?":"eBay","Which of the following online black markets, which was eventually shut down, used only bitcoins for transaction?":"Silk Road","Which of the following open-source e-commerce web applications was launched on March 31, 2008 under the name, Bento?":"Magento","Which of the following phone apps can be used as an automated pulse checker?":"Instant Heart Rate","Which of the following price comparison service websites has existed since 2000, and announced acquisition of NextCoupons in 2010?":"NexTag","Which of the following smart TV platforms was launched in October 2010, with Intel, Sony and Logitech as the developers?":"Google TV","Which of the following social media auction houses allows people to \"buy\" a retweet from stars with proceeds going to charity?":"TwitChange","Which of the following social media campaigns for charity went viral?":"Random Acts","Which of the following streaming media softwares broadcasted audio events over the Internet, on September 5th, 1995?":"RealNetworks","Which of the following use a client-server application architecture?":"All choices","Which of the following was a protest movement, where those involved had relied on social media to organize and stay connected?":"Arab Spring","Which of the following websites has the top earning income in the world to date?":"Google","Which of the following websites is a fashion encyclopedia?":"VogueEncyclo","Which of the following websites provides live sport streams, sport videos and live scores?":"LiveTV","Which of the following would not conduct electricity? ":"Plastic","Which of these 4 element comprises the smallest percentage by mass in the human body?":"Nitrogen","Which of these GUI concepts is not captured in the acronym \"WIMP\"?":"Web","Which of these HTML tags makes a numbered list?":"<ol>","Which of these HTTP status codes indicates that a requested web resource could not be found?":"404","Which of these HTTP status codes stands for \"OK\"?":"200","Which of these IP addresses is known as a loopback address?":"127.0.0.1","Which of these Linux distributions was derived from a German phrase translated as \"Software and Systems Development\"?":"SUSE","Which of these OOP (Object Oriented Programming) concepts is available in C++ but not in Java?":"Multiple inheritance","Which of these SQL commands chooses data from one or more database tables and/or views?":"Select","Which of these SQL commands merges the results of 2 or more SELECT SQL queries into 1 result set?":"Union","Which of these SQL commands selects data from 2 or more tables tied together by matching table columns?":"Join","Which of these SQL commands will return a list with duplicates removed, leaving only a single entry for each unique item?":"Distinct","Which of these abbreviations is used to describe GUI systems?":"WYSIWYG","Which of these algorithm types involves overlapping sub-problems and a lookup table of past solutions?":"Dynamic Programming","Which of these algorithm types is used to quickly find reasonable solutions to NP-Hard problems?":"Approximation Algorithms","Which of these animals can be taught sign language? ":"Chimp","Which of these animals is NOT extinct? ":"Goblin Shark","Which of these co-authored a key exchange cryptography protocol with Martin Hellman?":"Whitfield Diffie","Which of these colour pairs is also the name of a type of self-balancing tree data structure?":"Red-Black","Which of these companies is best known for its AutoCAD software?":"Autodesk","Which of these companies was not a leader in home computers in the early 1980s?":"Razer","Which of these computer languages came first?":"FORTRAN","Which of these computer science terms is usually defined as a set of steps to solve a particular problem?":"Algorithm","Which of these computer scientists co-invented the RSA algorithm?":"Leonard Adleman","Which of these computer scientists has written a series of books under the title \"The Art of Computer Programming\"?":"Donald Knuth","Which of these computer scientists was also a Rear Admiral in the US Navy?":"Grace Hopper","Which of these computer scientists, a pioneer in computer graphics, created a graphics program called \"Sketchpad\"?":"Ivan Sutherland","Which of these concepts allows an OS to use more memory than what is physically available to it?":"Virtual Memory","Which of these concepts from nature gives its name to a type of algorithm?":"Ant Colony","Which of these concepts in the field of databases did Edgar Codd invent?":"Relational model","Which of these data structures is also described as \"First In, First Out\" or FIFO?":"Queue","Which of these data structures is also described as \"Last In, First Out\" or LIFO?":"Stack","Which of these data structures is not a type of tree data structure?":"Cyclic","Which of these data structures typically does not contain duplicate elements?":"Set","Which of these effects contributes to global warming on Earth? ":"Greenhouse","Which of these elements is not a noble gas?":"Boron","Which of these engineers was involved in the creation of Unix?":"Ken Thompson","Which of these engineers was nicknamed \"The Mayor of Silicon Valley\"?":"Robert Noyce","Which of these error types is usually thrown when a program omits the right keywords or leaves out a delimiter?":"Compiler error","Which of these figures is three-dimensional?":"A cylinder","Which of these food items is associated with badly written code, especially one with poorly implemented branching?":"Spaghetti","Which of these fruits grows on a vine? ":"Grapes","Which of these has a positive electric charge? ":"Proton","Which of these has the highest heat capacity?":"Ocean","Which of these hats is also the name of a Linux distribution?":"Fedora","Which of these inventions is Thomas Edison not associated with? ":"Ice cream cone","Which of these is NOT a HTML table tag?":"<a href>","Which of these is NOT a command in the BASIC computer language?":"LISTEN","Which of these is NOT a correct variable type in C++?":"real","Which of these is NOT a data structure?":"C#","Which of these is NOT a form of precipitation?":"Wind","Which of these is NOT a normal method of internet connection?":"LED","Which of these is NOT a software program used to convert one form of code to another?":"Debugger","Which of these is NOT a standard computer operating system?":"Visio","Which of these is NOT a type of algorithm design?":"Static Programming","Which of these is NOT a type of algorithm?":"Straightforward","Which of these is NOT an allotrope of carbon?":"Ruby","Which of these is NOT an example of a RDBMS?":"Hbase","Which of these is NOT part of the water cycle? ":"Prostration","Which of these is a NP-complete problem?":"Boolean satisfiability","Which of these is a common function of a memory manager in an operating system?":"Page management","Which of these is a common synonym for the concept of a 'newline'?":"EOL","Which of these is a computer network software tool used to find the hops to a particular host across an IP network?":"Traceroute","Which of these is a computer network software tool used to test whether a particular host is reachable across an IP network?":"Ping","Which of these is a cryptoprotocol designed to provide communications security over the Internet?":"SSL","Which of these is a decentralized and non-hierarchical network with equipotent nodes?":"Peer-to-Peer","Which of these is a dynamic prototype-based programming language?":"JavaScript","Which of these is a famous text editor?":"Vim","Which of these is a form of electromagnetic radiation?":"Light","Which of these is a language used to query data from databases?":"SQL","Which of these is a media file format that is free from any patents?":"OGG","Which of these is a popular UNIX shell?":"Bash","Which of these is a popular development environment for languages such as Java?":"Eclipse","Which of these is a program that visits webpages to collect data for web search engines?":"Spider","Which of these is a programming language created by Alan Kay?":"Smalltalk","Which of these is a programming language used for logic programming?":"PROLOG","Which of these is a recording of a series of keystrokes?":"Macro","Which of these is a special purpose programming language designed for managing data held in a RDBMS?":"SQL","Which of these is a statement from SQL?":"SELECT","Which of these is a term associated with TCP/IP?":"Packet","Which of these is a type of a heap data structure?":"Fibonacci heap","Which of these is a type of algorithm design?":"Greedy","Which of these is a type of datatype in programming languages such as C and Java?":"float","Which of these is a type of graph searching algorithm?":"A*","Which of these is a type of malware that replicates itself to be transmitted to other machines?":"Worm","Which of these is a type of sorting algorithm?":"Cocktail sort","Which of these is a type of tree data structure?":"R-Tree","Which of these is a type of vegetable that is a plant root? ":"Carrots","Which of these is a typical methodology of the software development process?":"Waterfall","Which of these is a unit of energy? ":"Joule","Which of these is a valid IP4 address format?":"all of them","Which of these is an example of a data structure in computer science?":"Stack","Which of these is an example of a divide-and-conquer algorithm?":"Binary search","Which of these is an example of a keyboard layout (akin to QWERTY)?":"Dvorak","Which of these is an indicator species for water pollution? ":"Mayfly larva","Which of these is an invalid operator in C?":"\"+-\"","Which of these is an output produced as a result of a program failure, especially in Unix environments?":"Core dump","Which of these is another way of saying a decimal numbering system?":"Base10","Which of these is another way of saying a hexadecimal numbering system?":"Base16","Which of these is another way of saying an octal numbering system?":"Base8","Which of these is largest in memory terms?":"Gigabyte","Which of these is not a concept associated with databases?":"Desk","Which of these is not a fundamental part of any electrical circuit? ":"A bell","Which of these is not a good electrical conductor? ":"Paper","Which of these is not a kind of plant? ":"Abacus","Which of these is not a metamorphic rock?":"Limestone","Which of these is not a type of energy? ":"Soil","Which of these is not a type of sorting algorithm?":"Boss sort","Which of these is not an element of Ohm's law? ":"Light bulbs","Which of these is not an element?":"Water","Which of these is not found in the Earth's atmosphere? ":"Gold","Which of these is the automated process of negotiation that establishes a communication channel between multiple digital entities?":"Handshaking","Which of these is the main programming language for creating code for Apple devices?":"Swift","Which of these is the most popular top-level internet domain name?":".com","Which of these is the odd one out? ":"Turtle","Which of these is the successor to the cryptoprotocol SSL?":"TLS","Which of these is typically NOT a responsibility of an operating system?":"Printing to paper","Which of these isn't a wireless protocol?":"802.11h","Which of these key combinations is typically used to terminate programs in Unix environments?":"Ctrl-C","Which of these languages uses indentation instead of brackets as a way of indicating scope?":"Python","Which of these languages was created by Brendan Eich?":"Javascript","Which of these lives the shortest on average? ":"Bee","Which of these mathematicians has a functional programming language named after him?":"Haskell Curry","Which of these open problems of computer science is one of the Millennium Prize Problems by the Clay Mathematics Institute?":"Is P = NP?","Which of these operating systems is not derived from UNIX?":"z/OS","Which of these places gives its name to a type of randomized algorithm?":"Monte Carlo","Which of these problems does a Bellman-Ford algorithm try to solve?":"Shortest path","Which of these programming languages was designed by John McCarthy?":"Lisp","Which of these programming languages was the direct predecessor of C?":"B","Which of these programming paradigms best describes the C programming language?":"Procedural","Which of these programs is typically one of the first to be executed when a computer starts?":"Bootloader","Which of these programs is used for regular expression-based search in files, typically on UNIX-based systems?":"Grep","Which of these programs manages a device attached to a computer?":"Device Driver","Which of these protocols can be used to log in to a remote machine?":"Telnet","Which of these protocols operate above TCP?":"All","Which of these protocols operate above UDP?":"VoIP","Which of these qualities must an experiment have for it to be accepted by the scientific community?":"Replicable","Which of these scientists has a popular programming language named after him?":"Pascal","Which of these scientists invented an algorithm to find the shortest path between two nodes in a graph?":"Dijkstra","Which of these scientists is credited with inventing the World Wide Web?":"Tim Berners-Lee","Which of these services is contacted when a web browser tries to find the IP address from a website's name?":"DNS","Which of these sharks is not generally dangerous to humans? ":"Nurse","Which of these sorting algorithm uses the concept of a \"pivot\" element?":"Quicksort","Which of these symbols is used in some languages as a delimiter to end a line of instruction?":"Semi-colon","Which of these symbols is used to indicate a comment in Perl?":"#","Which of these techniques is used as a practical though not fully reliable alternative to a proper algorithm?":"Heuristic","Which of these terms denotes a running program in the context of an OS?":"Process","Which of these terms denotes an external notification to an OS to potentially switch from the current program to another?":"Interrupt","Which of these terms describes a bunch of code that can be invoked and readily used by a program?":"Library","Which of these terms describes an operating system that allows more than one program to be run on a machine at the same time?":"Multi-tasking","Which of these terms indicates a function in a program that calls itself?":"Recursion","Which of these terms indicates a preliminary version of a program which is not yet implemented in a formal programming language?":"Pseudocode","Which of these terms indicates software that manages virtual machines?":"Hypervisor","Which of these terms indicates that the OS does not have a requested 'page'?":"Page fault","Which of these terms indicates using an operator for more than one function depending on context without changing its name?":"Operator overloading","Which of these terms is not a type of variable in programming languages such as C?":"liquid","Which of these terms is used to denote a concept in C in which a variable refers to a memory location?":"Pointer","Which of these terms is used to describe the delay in sending or receiving a message on a network?":"Latency","Which of these terms refers to technology that allows people to get access to large computing power on-demand over a network?":"Cloud computing","Which of these types of memory is \"Read-Only\"?":"ROM","Which of these types of rock floats on water? ":"Pumice","Which of these was a gigantic shark, before it went extinct? ":"Megalodon","Which of these words is a common synonym for restarting a device?":"Reboot","Which of these would be a positive development for any species? ":"New food source","Which online automotive research and shopping website, founded in 2005, assists users in comparing local listings for cars?":"CarGurus","Which online automotive research portal and car buy service was the first company to sell vehicles online directly to consumers?":"CarsDirect","Which online community site for car enthusiasts allows users to create profiles of their cars including pictures and write-ups?":"CarDomain","Which online database for fashion was described by Guy Trebay of The New York Times as \"The industry's favorite reference site\"?":"Models.com","Which online fashion site, founded in 2008, is designed for fashion enthusiasts and bloggers to set up online shops?":"Chictopia","Which online grocer is popular for its distribution of organic food and locally grown items?":"FreshDirect","Which online magazine, founded in 2008, is dedicated to bringing its readers up to date info on anything related to fashion?":"Fashify","Which online marketplace, founded in 1997, aggregates millions of new, used, and certified second-hand cars?":"AutoTrader.com","Which online ordering website includes services for restaurants, grocers, wine and spirits shops, and was founded in 2004?":"Delivery.com","Which online payment method, is by far, the most popular?":"Credit card","Which online retailer was the first company to accept bitcoins transactions?":"Overstock.com","Which online street fashion community is designed to encourage networking between both novice and established bloggers?":"Weardrobe","Which online subscription fashion retalier was founded by Don Ressler and Adam Goldenberg in March 2010?":"JustFab","Which open source software project was started in 1997 by Miguel de Icaza and Federico Mena?":"GNOME","Which organ pumps blood around the human body?":"Heart","Which pair co-discovered a theory of vitamin deficiency disease (1912)?":"FG Hopkins & Casimir Funk","Which part of a flower is often scented and attracts insects? ":"Petal","Which part of a light bulb gets hot and lights up? ":"Filaments","Which part of a plant takes up minerals? ":"Roots","Which part of a shark is continuously expelled and replenished? ":"Teeth","Which part of the Earth's atmosphere do people inhabit?":"Troposphere","Which part of the body does gout most commonly affect?":"Big toe","Which part of the earth receives the smallest total annual solar radiation?":"The arctic","Which phrase, intimately associated with the technology industry in California, was reputedly coined by Ralph Vaerst?":"Silicon Valley","Which planet has an axis-tilt of 98°, meaning its poles have sunlight for 42 years followed by 42 years of darkness?":"Uranus","Which planet has the Great Red Spot in its atmosphere?":"Jupiter","Which planet has the most moons?":"Jupiter","Which planet has the tallest known mountain?":"Mars","Which planet in our solar system has an orbital period of 687 days?":"Mars","Which planet in the Solar System is closest in size to Earth? ":"Venus","Which planet of the solar system is often called the Red Planet?":"Mars","Which popular app can wake you up at the optimal time during your lightest sleep cycle?":"Sleep Cycle alarm clock","Which precursor to the C programming language was created by Ken Thompson?":"B","Which price comparison website, founded in 2013, is designed to aggregate bus travel information?":"ClickBus","Which primitive data type is best for whole numbers?":"int","Which programming language was created by James Gosling?":"Java","Which programming language was designed by Martin Odersky?":"Scala","Which programming language was written by Larry Wall?":"Perl","Which programming language, a C derivative, was created by Bjarne Stroustrup?":"C++","Which programming language, named for a scientist, was created by Niklaus Wirth?":"Pascal","Which programming paradigm was Alan Kay best known for working on?":"Object oriented","Which regional Internet registry serves Africa?":"AfriNIC","Which regional Internet registry serves Asia, Australia, and New Zealand (and neighboring countries/islands)?":"APNIC","Which regional Internet registry serves Latin America and parts of the Carribean?":"LACNIC","Which research lab did Steve Jobs visit in 1979, which inspired him to incorporate a GUI in Apple's products?":"Xerox PARC","Which rock type is NOT igneous?":"Schist","Which rock type is sedimentary?":"Sandstone","Which scale measures the spicy \"hotness\" or pungency of chili peppers (or other spicy food)?":"Scoville","Which scientist designed the analytical engine, the first attempt at a general computing device?":"Charles Babbage","Which scientist has an \"Exclusion Principle\" named after them?":"Wolfgang Pauli","Which social networking portal connects a universe of urban and upwardly mobile women with a mutual passion of fashion?":"Clozette","Which social networking support group website consists of over 280 Internet message boards for patient to patient health support?":"HealthBoards","Which software program is Stephen Bourne best known for writing?":"sh","Which space agency landed a probe on a comet in 2014?":"ESA","Which spacecraft, launched in 1972, was originally destined for studying Jupiter?":"Pioneer 10","Which species of animal has the greatest variety of shape and size?":"Dogs","Which species of cat is unusually social? ":"Lion","Which standard was created to help interoperability in Unix?":"POSIX","Which statement is true about a C++ void pointer?":"All listed answers","Which structured programming language with concurrency support was named after Ada Lovelace?":"Ada","Which subatomic particle in the nucleus of an atom has a charge of +1?":"Proton","Which symbol is also known as the octothorpe or the hash?":"#","Which symbol is also nicknamed the \"bang\"?":"!","Which technique allows an int value to appear to be a double value for this calculation: avg = sumx / double( numofstudents);":"explicit casting","Which technology, used in computer storage devices and connections, is represented by a logo with a trident?":"USB","Which temperature has the same value in Fahrenheit & Celsius?":"-40","Which temperature has the same value in degrees in both centigrade and Fahrenheit?":"-40","Which term in object oriented programming typically is used to describe an encapsulation of variables and methods?":"Class","Which term means to check data for accuracy by range, type, and/or format?":"Validation","Which term refers to the measure of CPU speed in cycles per second?":"Hertz","Which term, taken from Sonar, is the name of a program that tries to contact a server to see if it is responsive?":"Ping","Which terms did Oliver Heaviside coin in relationship to electromagnetic theory?":"Permeability","Which two planets do not have moons?":"Mercury and Venus","Which type of C++ object can have its elements changed, added to, or removed?":"Mutable","Which type of algorithm is applied to a data structure to ensure all its elements are arranged according to a pre-decided order?":"Sorting","Which type of connectionless transport service does UDP deliver?":"Unreliable","Which type of digital network communications network groups all transmitted data into blocks, regardless of content?":"Packet switching","Which type of file indicates a library of compressed files stored as a single file?":".cab","Which type of games are in the \"Call of Duty\" series?":"Shooter","Which type of internet connection is usually the quickest of those listed?":"Fiber","Which type of languages support the task of system architecture creation, refinement and validation?":"ADLs","Which type of power station produces carbon dioxide? ":"Gas burning","Which type of steel is likely to be used for making cutlery? ":"Stainless","Which version control software was co-written by Linus Torvalds?":"Git","Which version of DOS was created by Microsoft in the 1980s?":"MS-DOS","Which version of Windows came first on this list?":"98","Which vertical media company published The Car Connection and Motor Authority websites and mobile applications?":"High Gear Media","Which was the first country to formally recognize and regulate bitcoins?":"Germany","Which was the first language implementing nested function definitions with lexical scope?":"ALGOL 60","Which web-based digital platform comprises a bespoke social community for drivers, online magazines, and video channels?":"Drivers Republic","Which web-based food and delivery services partners with local restaurants in over 1,000 US cities, and was founded in 2008?":"Eat24","Which website aims to help women find fashion items online, where they can add items to the website with a bookmarklet?":"Fashiolista","Which website covers all things related to classic and historic cars, events, and related car culture in New Zealand?":"NZ Classic Car magazine","Which website encourages taking action against discrimination of bandwidth distribution on the Internet?":"Save the Internet","Which website is an online automotive complaint resource that uses graphs to show automotive defect patterns?":"CarComplaints.com","Which website is an online library of fashion design videos, operated by Francesca Sterlacci?":"University of Fashion","Which website offers discounts on dinners and banquets, and sells virtual tours of participating restaurants?":"Restaurant.com","Which website serves as an online news, picture and information service for the international automotive design community?":"Car Design News","Which website started e-commerce home delivery operations in 1995 when it introduced \"Wine Direct\" for Internet wine sales?":"Sainsbury's Online","Which website was launched in March 2012 with the aim of organizing future online protests of anti-piracy legislation?":"Internet Defense League","Which website, founded in 1996, has information regarding health and health care, including a symptom checklist, and the likes?":"WebMD","Who built the first nuclear reactor in 1942?":"Enrico Fermi","Who can create a bitcoin fork?":"Anybody","Who coined the term \"robotics\" in his 1941 short-story entitled \"Liar!\"?":"Isaac Asimov","Who created the Linux kernel?":"Linus Torvalds","Who created the first version of the Linux kernel?":"Linus Torvalds","Who created the popular Hadoop software framework for storage and processing of large datasets?":"Doug Cutting","Who demonstrated that fermentation is caused by the growth of micro-organisms?":"Louis Pasteur","Who designed the C programming language?":"Dennis Ritchie","Who developed OLE, a technology that allows embedding and linking to objects?":"Microsoft","Who developed the Visual Basic language in 1991?":"Microsoft","Who developed the electromagnetic theory of light in 1873?":"James Maxwell","Who developed the first rabies immunization in 1885?":"Louis Pasteur & Emile Roux","Who discovered Uranus in 1781 and also had a famous scientist sister (Caroline), who was also an astronomer?":"William Herschel","Who discovered how to isolate Oxygen in 1774?":"Joseph Priestley","Who discovered laws of heredity in 1865?":"Gregor Mendel","Who discovered laws of planetary motion in 1609?":"Johannes Kepler","Who discovered radioactivity in Uranium in 1896?":"Henri Becquerel","Who discovered the element Oxygen?":"Joseph Priestley","Who discovered the proton in 1919?":"Ernest Rutherford","Who first argued that the world was not flat? ":"Aristotle","Who first improved Lippershey's original telescope invention?":"Galileo Galilei","Who first proposed quantum theory in 1900?":"Max Planck","Who flew in Vostok 1?":"Yuri Gagarin","Who founded the main international standards organization for World Wide Web, also know as the World Wide Web Consortium?":"Tim Berners-Lee","Who invented \"bifocal\" lenses for eyeglasses?":"Benjamin Franklin","Who invented C++?":"Bjarne Stroustrup","Who invented Ethernet along with Robert Metcalfe?":"David Boggs","Who invented a hot-air balloon in 1783?":"Joseph Montgolfier","Who invented a hovercraft?":"Christopher Cockerell","Who invented a way to organize all the elements into a periodic table in 1869?":"Dmitri Mendeleev","Who invented dynamite?":"Alfred Nobel","Who invented intelligence testing in 1905?":"Alfred Binet","Who invented the World Wide Web in 1989?":"Tim Berners-Lee","Who invented the centigrade scale?":"Anders Celsius","Who invented the elevator safety brake in 1852?":"Elisha Otis","Who invented the most common cylindrical map projection concept for world maps?":"Gerhardus Mercator","Who invented the pneumatic tire, which was first used on bicycles?":"John Dunlop","Who invented the revolver in 1835?":"Samuel Colt","Who invented the safety razor in 1901?":"King Gillette","Who invented the stethoscope in 1819?":"Rene Laennec","Who is considered the \"Father\" of western medicine?":"Hippocrates","Who is credited with inventing the light bulb?":"Thomas Edison","Who is credited with the discovery of the electron in 1897?":"JJ Thompson","Who is generally regarded as the 'father of supercomputing'?":"Seymour Cray","Who is the author of the book \"Hackers and Painters\"?":"Paul Graham","Who is the author of the book series \"The Art of Computer Programming\"?":"Donald Knuth","Who is the chief villain in the \"Mario Bros.\" video games?":"Bowser","Who is the manager of the Howard Dean campaign, who said that the Internet is \"tailor-made for a populist, insurgent movement\"?":"Joe Trippi","Who is the youngest Physics Nobel Laureate, when in 1915 and at age 25, he won the prize?":"Lawrence Bragg","Who is this famous scientist?":"Albert Einstein","Who is usually credited with inventing the telephone in 1876?":"Alexander Graham Bell","Who makes the WWW standards?":"World Wide Web Consortium","Who named, but did NOT invent, the gyroscope (1852)?":"Leon Foucault","Who started a company called \"PCs Unlimited\" in 1984 from his dorm room, which would later morph into a company named after him?":"Michael Dell","Who started the GNU project?":"Richard Stallman","Who theorized about continental drift in 1912?":"Alfred Wegener","Who theorized on evolution by natural selection in 1859?":"Charles Darwin","Who vulcanized rubber in 1839?":"Charles Goodyear","Who was given the Turing Award in 2009 for his work on the Xerox Alto?":"Charles Thacker","Who was jointly awarded the Turing Award in 1983 along with Dennis Ritchie?":"Ken Thompson","Who was known as \"the wizard of Menlo Park\"?":"Thomas Edison","Who was not featured as a primary villain in the \"Spider-Man 3\" video game?":"Scarecrow","Who was the first person to represent trigonometric values as ratios?":"Leonard Euler","Who was the founder of social networking service, Facebook?":"Mark Zuckerberg","Who was the founder of software platform Ethereum, designed for cryptographically-secure transactions?":"Vitalik Buterin","Who would most likely use a chi-square test?":"A statistician","Who wrote the famous science book \"Philosophiæ Naturalis Principia Mathematica\"":"Newton","Who wrote the paper \"The Complexity of Theorem Proving Procedures\", a pioneering work in the field of computational complexity?":"Stephen Cook","Whose Turing award speech introduced the concept of the backdoor attack in compilers?":"Ken Thompson","Whose address will be stored within a pointer which points to an array? (C++)":"Array's first element","Whose constant is used to define a mole as 6.022 x 10²³ particles?":"Avogadro","Whose law is this: F = G (m₁ × m₂) ÷ r²":"Newton's","Whose main purpose is to define a set of functionalities that are independent of its implementations?":"API","Whose work on human-computer interaction concepts such as the mouse and GUIs was shown in the Mother of All Demos in 1968?":"Douglas Engelbart","Why are high voltage power lines used? ":"Improves efficiency","Why are white peppered moths likely to be more common than black ones in forests? ":"Better camouflaged","Why can gold be found in the Earth's crust in its native state? ":"It's unreactive","Why do most sharks constantly move for their entire lives? ":"To Breathe","Why do we have a good evolutionary record of the horse? ":"Fossil record complete","Why is titanium expensive to extract from its ore? ":"Many stages","Wim Ebbinkhuijsen is considered one of the founders of which programming language?":"COBOL","Wireless protocol 802.11ac was released in 2014 and broadcasts at ___ GHz.":"5","Wireless specification 802.11ac allows for how many MIMO streams?":"8","Wireless specification 802.11n allows for how many MIMO streams?":"4","With 1 exception, valence electron counts are determined by the units digit of the Periodic Table group #. What group is exempted?":"Transition metals","With the right tools, what can companies analyze from their online customers, and use it to improve social marketing strategies?":"Behavior","Within the hacking community, what are those who carry out automated attacks generally known as?":"Script kiddies","You can be adamant that the name for what gem comes from the Greek word for invincible?":"Diamond","___ is a branch of biology that studies organic particles that are transported by the air.":"Aerobiology","___ is the study of algae.":"Algology","___ is the study of bees.":"Apiology","___ is the study of humans.":"Anthropology","___ is the study of male health.":"Andrology","___ is the study of past cultures.":"Archaeology","___ is the study of plant nutrition and growth in relation to soil.":"Agrobiology","___ is the study of relationships between humans and animals over time.":"Archaeozoology","___ is the study of spiders.":"Arachnology","___ is the study of the anatomy of blood and lymph vascular systems.":"Angiology","autohideChat":"false","debug":"","pusherTransportEncrypted":"{\"timestamp\":1461848082287,\"transport\":\"ws\",\"latency\":712}"," Which is the \"fastest\" planet?":"Mercury","²⁸Si is an isotope of Silicon. How many neutrons does it have if it has 14 protons?":"14"}